## ¿Qué es Pandas?

Pandas es una de librería de Python para la manipulación y el análisis de datos basada en NumPy.

![](files/320px-Pandas_logo.png)

In [1]:
import pandas as pd
import numpy as np

### Series
La Serie es el componente básico de Pandas. Una serie es una estructura de datos unidimensional indexada basada en el array de NumPy.

La ventaja de las Series son:
- Posibilidad de asignarle un nombre.
- Mayor flexibilidad en los índices.

El constructor pd.Series() se utiliza para construir una serie a partir de distintos elemendos tales como valores escalares, listas, tuplas, diccionarios, arrays, etc.

Probemos definir una serie a partir de una lista:

In [2]:
s1 = pd.Series([1, 3, 5, np.nan, 6, 8])
s1

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Las series se crean con un índice automático que empieza en cero y termina en seis (recordar que Python empieza a contar desde cero y se refiere al último elemento de un rango de forma EXclusive.

In [3]:
s1.index

RangeIndex(start=0, stop=6, step=1)

En este caso el valor de stop coincide con la cantidad de elementos de nuestro índice, pero atención que esto solo sucede porque nuestro índice va uno en uno (step). Si nuestra intención es conocer cuántos elementos tiene nuestro índice, es más apropiado usar el método size.

In [4]:
s1.size

6

Nosotros podemos redefinir nuestro índice, probemos con un índice que empiece en 5 y se incremente de 5 en 5.

In [5]:
s1.index = pd.RangeIndex(start=5, stop=35, step=5)
s1

5     1.0
10    3.0
15    5.0
20    NaN
25    6.0
30    8.0
dtype: float64

Los índice también pueden ser del tipo string, ello lo podemos lograr pasándole una lista con strings en el argumento **index**:

In [6]:
s2 = pd.Series([1,2,3,4,5], index=["a","b","c","d","e"])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

Como habíamos dicho, también podemos podemos crear series a partir de otros elementos, por ejemplo un diccionario.

**Recordemos que los diccionarios se definen de la siguiente manera:**
diccionario = {clave_1: valor_1, clave_2: valor_2, clave_n: valor_n}

Cuando convertimos un diccionario en una Serie, las claves de este pasarán a ser el índice.

In [7]:
notas_parcial = {"Ana": 8, "Pedro": 7, "Laura": 9, "Martín": 8.5}
s3 = pd.Series(notas_parcial, name="Nota")
s3

Ana       8.0
Pedro     7.0
Laura     9.0
Martín    8.5
Name: Nota, dtype: float64

Además, aprovechamos y le agregamos un nombre a nuestra Serie con el argumento **name**, este nombre va ser el nombre de la columna en caso de convertir la Serie en una "tabla" o DataFrame (spoiler alert!).

In [8]:
df = pd.DataFrame(s3)
df

        Nota
Ana      8.0
Pedro    7.0
Laura    9.0
Martín   8.5

Antes de pasar a los dataframes, veámos algunos conceptos restantes de las series que también aplican a los dataframes. Recordemos a la que le habíamos cambiado el índice para que se incremente de 5 en 5.

#### reset_index

In [9]:
s1

5     1.0
10    3.0
15    5.0
20    NaN
25    6.0
30    8.0
dtype: float64

Si nosotros quisiéramos volver al índice original, deberíamos usar reset_index()

In [10]:
s1.reset_index()

   index    0
0      5  1.0
1     10  3.0
2     15  5.0
3     20  NaN
4     25  6.0
5     30  8.0

In [11]:
type(s1.reset_index())

pandas.core.frame.DataFrame

¿Por qué Pandas convirtió nuestra serie en un dataframe? Recordemos que las series son unidimensionales, por lo tanto solo pueden tener una sola columna. Pandas creó un nuevo índice pero a nuestro viejo índice lo convirtió en la columna "index" y esto es importante porque Pandas evitó que perdiéramos datos. En este ejemplo resulta abstracto, pero en el caso de las Notas (s3), si Pandas no preservara el índice original, hubiéramos perdido el nombre de los alumnos.

Si no nos interesa conservar el índice anterior o queremos evitar que Pandas convierta la serie en un dataframe utilizamos el argumento drop en True.

In [12]:
#Notas
s3.reset_index(drop=True)

0    8.0
1    7.0
2    9.0
3    8.5
Name: Nota, dtype: float64

#### Inplace

Nosotros podemos resetear el índice de dos maneras:

1. **Redefiniendo el objeto:** "pisándolo" con uno nuevo.
2. **Sobre el mismo objeto:** (inplace=True).

Veamos cómo hacerlo de las dos formas.

In [13]:
#1) Redefiniendo el objeto
#Creamos una serie para resetearle el índice
s4 = pd.Series([100,110,120,110], index=[1001,1002,1003,1004])
s4

1001    100
1002    110
1003    120
1004    110
dtype: int64

In [14]:
#Reseteamos el índice descartando el índice anterior (drop=True)
s4= s4.reset_index(drop=True)
s4

0    100
1    110
2    120
3    110
dtype: int64

**Lo que hicimos fue redefinir el objeto s4 indicándole que será igual al objeto s4 pero con el índice reseteado.**

Ahora probemos hacerlo de la segunda manera:

In [15]:
#2) Sobre el mismo objeto:

#Creamos una serie para resetearle el índice
s5 = pd.Series([100,110,120,110,np.nan], index=[1001,1002,1003,1004,1005])
s5

1001    100.0
1002    110.0
1003    120.0
1004    110.0
1005      NaN
dtype: float64

In [16]:
#Reseteamos el índice sin guardar el índice anterior (drop=True)
s5.reset_index(inplace= True, drop=True)
s5

0    100.0
1    110.0
2    120.0
3    110.0
4      NaN
dtype: float64

**En este caso, al utilizar el argumento inplace en True, no tuvimos necesidad de definir nuevamente el objeto (s5 = ...)**

#### value_counts
Con el método value_counts() podemos obtener la distribución de frecuencias de una serie, por defecto omite los valores nan.

* **ascending= True:** Ordena de menor a mayor.
* **normalize= True:** Expresa los resultados al tanto por uno.
* **dropna= True:** Omite los nan.

In [17]:
s5.value_counts()

110.0    2
120.0    1
100.0    1
dtype: int64

In [18]:
s5.value_counts(ascending=True, normalize=True, dropna=False)

100.0    0.2
120.0    0.2
NaN      0.2
110.0    0.4
dtype: float64

### DataFrames

Un DataFrame es una estructura de datos indexada bidimensional con columnas de tipos potencialmente diferentes. Puede pensarse como una tabla en un hoja de cálculo, una tabla de una base de datos SQL, o un diccionario de objetos.

Podemos construir dataframes a partir de listas anidadas, tuplas anidadas, arrays, diccionarios, series o a través de la lectura de archivos.

Cada columna del dataframe puede ser te un tipo distinto, más adelante veremos esto.

* **Desde listas anidadas:**

Cada una de las listas anidadas, será una fila de nuestro dataframe. La cantidad de elementos que contengan nuestras listas determinará la cantidad de columnas. En nuestro caso, nuestra primera lista anidada tiene solo tres elementos, pero las restantes contienen cuatro, por ello la primer fila se completa automáticamente con un valor NaN.

In [19]:
Lista_anidada = [[0,1,2] , [3,4,5,6] , [7,8,9,np.nan]]
Lista_anidada

[[0, 1, 2], [3, 4, 5, 6], [7, 8, 9, nan]]

In [20]:
pd.DataFrame(Lista_anidada)

   0  1  2    3
0  0  1  2  NaN
1  3  4  5  6.0
2  7  8  9  NaN

Pero nuestro dataframe todavía es muy poco legible, si no asignamos un nombre a priori, los nombres de las columnas estarán dados por números que, como todo en Python empiezan en cero. Empecemos bien y creemos un dataframe con nombres claros.

In [21]:
df1 = pd.DataFrame(Lista_anidada,
                   columns=["Columna_A", "Columna_B", "Columna_C","Columna_D"])
df1

   Columna_A  Columna_B  Columna_C  Columna_D
0          0          1          2        NaN
1          3          4          5        6.0
2          7          8          9        NaN

Al igual que en las series, también podemos personalizar los índices al crear el dataframe pasando los nombres de las columnas como una lista.

In [22]:
df1 = pd.DataFrame(Lista_anidada,
                   columns=["Columna_A", "Columna_B", "Columna_C","Columna_D"],
                  index= ["ID_1","ID_2","ID_3"])
df1

      Columna_A  Columna_B  Columna_C  Columna_D
ID_1          0          1          2        NaN
ID_2          3          4          5        6.0
ID_3          7          8          9        NaN

* **Desde tuplas anidadas:**

In [23]:
Tupla_anidada = ((0,1,2),(3,4,5,6),(7,8,9,np.nan))
Tupla_anidada

((0, 1, 2), (3, 4, 5, 6), (7, 8, 9, nan))

In [24]:
df2 = pd.DataFrame(Tupla_anidada,
                   columns=["Columna_A", "Columna_B", "Columna_C","Columna_D"],
                  index= ["ID_1","ID_2","ID_3"])
df2

      Columna_A  Columna_B  Columna_C  Columna_D
ID_1          0          1          2        NaN
ID_2          3          4          5        6.0
ID_3          7          8          9        NaN

El ejemplo anterior es bastante trivial, por eso utilizamos tuplas anidades en tuplas, lo más probable es que si nos encontramos con un script que convierte tuplas anidadas en un dataframe, estas estén anidadas en una lista ***[(x1,y1,z1),(x2,y2,z2)]*** en lugar de una tupla ya que las tuplas son elementos inmutables.

* **Desde diccionario:** 

En este caso, en cada clave definimos las columnas y en sus valores se encontrarán dentro de listas.

Diccionario = {"Clave: valor}

DataFrame desde diccionario = {"Columna": [cada,valor,de,la,columna]}

**Tener en cuenta que cuando creamos un dataframe desde un diccionario, cada lista que contenga los elementos debe tener la misma longitud.**

In [25]:
pd.DataFrame({"Columna_A": [0,3,7],
             "Columna_B": [1,4,8],
             "Columna_C": [2,5,9],
             "Columna_D": [np.nan,6,np.nan]
             })

   Columna_A  Columna_B  Columna_C  Columna_D
0          0          1          2        NaN
1          3          4          5        6.0
2          7          8          9        NaN

In [26]:
array = np.array([[0,1,2,np.nan],[3,4,5,6],[7,8,9,np.nan]])
pd.DataFrame(array, columns=["Columna_A", "Columna_B", "Columna_C","Columna_D"])

   Columna_A  Columna_B  Columna_C  Columna_D
0        0.0        1.0        2.0        NaN
1        3.0        4.0        5.0        6.0
2        7.0        8.0        9.0        NaN

#### Tipos de datos


| Pandas dtype     | Python type     | NumPy type     | Usage|
|-----------------|:---------------------:|:---------------------:|:---------------------:|
| object     | str     | string_, unicode_     | Text|
| int64     | int     | int_, int8, int16, int32, int64, uint8, uint16, uint32, uint64     | Integer numbers|
| float64     | float     | float_, float16, float32, float64     | Floating point numbers|
| bool     | bool     | bool_     | True/False values|
| datetime64     | NA     | datetime64[ns]     | Date and time values|
| timedelta[ns]     | NA     | NA     | Differences between two datetimes|
| category     | NA     | NA     | Finite list of text values |

**Recuerden que cada columna de puede contener datos de distinto tipo.**

Por ejemplo:

In [27]:
df3 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20210810'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo',
    'G': [1,2,1,2]
})
df3

     A          B    C  D      E    F  G
0  1.0 2021-08-10  1.0  3   test  foo  1
1  1.0 2021-08-10  1.0  3  train  foo  2
2  1.0 2021-08-10  1.0  3   test  foo  1
3  1.0 2021-08-10  1.0  3  train  foo  2

Inspeccionemos los tipos de nuestras columnas:

In [28]:
df3.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G             int64
dtype: object

En nuestro ejemplo, tenemos números fraccionarios y enteros con distinto nivel de precisión, fechas, una variable ordinal (category) y una de tipo object que contiene solo datos de tipo string.

* **Importar datos desde archivos:**

En nuestro caso vamos a estudiar cómo importar archivos con extensión .csv pero también es posible convertir a dataframe archivos .txt, .json, .xlsx, xls, etc. Invitamos a leer la documentación de Pandas para ampliar este tema.

**¿Qué es un archivo .csv?**

Los archivos con extensión .csv (*comma-separated values*) son archivos de texto plano cuyos valores se encuentran separados por un delimitador, por lo general una ",".

Si abrimos un archivo csv en un bloc de notas veremos algo así:

*make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
AMC Concord,4099,22,3,2.5,11,2930,186,40,121,3.5799999,Domestic
AMC Pacer,4749,17,3,3,11,3350,173,40,258,2.53,Domestic
AMC Spirit,3799,22,,3,12,2640,168,35,121,3.0799999,Domestic
Buick Century,4816,20,3,4.5,16,3250,196,40,196,2.9300001,Domestic*

La primera fila representa el nombre de nuestras columnas (el header) y las restantes son las filas de nuestro dataframe.

In [29]:
df4 = pd.read_csv(
    'data/auto.csv',     # file path
    delimiter=',',       # delimitador ',',';','|','\t'
    header=0,            # número de fila como nombre de columna
    names=None,          # nombre de las columnas (ojo con header)
    index_col=0,         # que col es el índice
    usecols=None,        # que col usar. Ej: [0, 1, 2], ['foo', 'bar', 'baz']
    dtype=None,          # Tipo de col {'a': np.int32, 'b': str} 
    skiprows=None,       # saltear filas al inicio
    skipfooter=0,        # saltear filas al final
    nrows=None,          # n de filas a leer
    decimal='.',         # separador de decimal. Ej: ',' para EU dat
    quotechar='"',       # char para reconocer str
    #encoding=None,      # archivos con tilde y ñ por lo general utilizan "utf-8" etc 
)

df4

,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
make,,,,,,,,,,,
AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic
...,...,...,...,...,...,...,...,...,...,...,...
VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign
VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign

Si quisiésemos hacer el camino inverso y guardar el dataframe en csv...

In [30]:
df4.to_csv("data/df4_a_csv.csv",
           index=False,       #Index false para que no guarde el índice como una columna
          encoding= "utf-8")  #No es el caso pero si estuvíeramos usando un df en español

Ahora revisemos un poco nuestro dataframe...

**Descripción del índice:**

In [31]:
df4.index

Index(['AMC Concord', 'AMC Pacer', 'AMC Spirit', 'Buick Century',
       'Buick Electra', 'Buick LeSabre', 'Buick Opel', 'Buick Regal',
       'Buick Riviera', 'Buick Skylark', 'Cad. Deville', 'Cad. Eldorado',
       'Cad. Seville', 'Chev. Chevette', 'Chev. Impala', 'Chev. Malibu',
       'Chev. Monte Carlo', 'Chev. Monza', 'Chev. Nova', 'Dodge Colt',
       'Dodge Diplomat', 'Dodge Magnum', 'Dodge St. Regis', 'Ford Fiesta',
       'Ford Mustang', 'Linc. Continental', 'Linc. Mark V', 'Linc. Versailles',
       'Merc. Bobcat', 'Merc. Cougar', 'Merc. Marquis', 'Merc. Monarch',
       'Merc. XR-7', 'Merc. Zephyr', 'Olds 98', 'Olds Cutl Supr',
       'Olds Cutlass', 'Olds Delta 88', 'Olds Omega', 'Olds Starfire',
       'Olds Toronado', 'Plym. Arrow', 'Plym. Champ', 'Plym. Horizon',
       'Plym. Sapporo', 'Plym. Volare', 'Pont. Catalina', 'Pont. Firebird',
       'Pont. Grand Prix', 'Pont. Le Mans', 'Pont. Phoenix', 'Pont. Sunbird',
       'Audi 5000', 'Audi Fox', 'BMW 320i', 'Datsun 200', 'Datsun 210',
       'Datsun 510', 'Datsun 810', 'Fiat Strada', 'Honda Accord',
       'Honda Civic', 'Mazda GLC', 'Peugeot 604', 'Renault Le Car', 'Subaru',
       'Toyota Celica', 'Toyota Corolla', 'Toyota Corona', 'VW Dasher',
       'VW Diesel', 'VW Rabbit', 'VW Scirocco', 'Volvo 260'],
      dtype='object', name='make')

**Nombres de las columnas:**

Columns devuelve un array con los nombres de las columnas. Tenemos que tener en cuenta que el índice no es una columna, es una etiqueta para nuestras filas.

In [32]:
df4.columns

Index(['price', 'mpg', 'rep78', 'headroom', 'trunk', 'weight', 'length',
       'turn', 'displacement', 'gear_ratio', 'foreig'],
      dtype='object')

**Tipos de datos:**

dtypes devuelve una serie con el tipo de de cada columna.

In [33]:
df4.dtypes

price             int64
mpg               int64
rep78           float64
headroom        float64
trunk             int64
weight            int64
length            int64
turn              int64
displacement      int64
gear_ratio      float64
foreig           object
dtype: object

**Forma del dataframe:**

Shape devuelve una tupla con la cantidad de filas y de columnas (filas, columnas).

In [34]:
df4.shape

(74, 11)

También podemos descomponer la tupla para obtener la cantidad de filas o columnas individualmente:

In [35]:
df4.shape[0] #Filas

74

In [36]:
df4.shape[1] #Columnas

11

Contar solo las filas:

In [37]:
len(df4)

74

Contar solo las columnas.

In [38]:
len(df4.columns)

11

**Ver dataframe como un array de Numpy:**

In [39]:
df4.values[:5] #Utilizamos "[:5]" para ver lo que serían las primeras 5 filas y el output no sea eterno.

array([[4099, 22, 3.0, 2.5, 11, 2930, 186, 40, 121, 3.5799999,
        'Domestic'],
       [4749, 17, 3.0, 3.0, 11, 3350, 173, 40, 258, 2.53, 'Domestic'],
       [3799, 22, nan, 3.0, 12, 2640, 168, 35, 121, 3.0799999,
        'Domestic'],
       [4816, 20, 3.0, 4.5, 16, 3250, 196, 40, 196, 2.9300001,
        'Domestic'],
       [7827, 15, 4.0, 4.0, 20, 4080, 222, 43, 350, 2.4100001,
        'Domestic']], dtype=object)

In [40]:
type(df4.values)

numpy.ndarray

**Uso de memoria:**

memory_usage() nos devuelve una serie con la cantidad de memoria ram en bytes que ocupa cada columna del dataframe. Se recomienda utilizar el argumento deep para tener una respuesta de mayor precisión.

In [41]:
df4.memory_usage(deep=True)

Index           5089
price            592
mpg              592
rep78            592
headroom         592
trunk            592
weight           592
length           592
turn             592
displacement     592
gear_ratio       592
foreig          4788
dtype: int64

Para ver el total de memoria utilzada por el dataframe:

In [42]:
df4.memory_usage(deep=True).sum()

15797

Expresado en megabytes:

In [43]:
df4.memory_usage(deep=True).sum()/(1024**2)

0.015065193176269531

1 kilobyte = 1024 bytes

1 megabyte = 1024 kilobytes

1 gigabyte = 1024 megabytes

1 terabyte = 1024 gigabytes
  
y así sucesivamente...

**Contar valores no NaN:**

In [44]:
df4.count()

price           74
mpg             74
rep78           69
headroom        74
trunk           74
weight          74
length          74
turn            74
displacement    74
gear_ratio      74
foreig          74
dtype: int64

**Resumen general:**

Devuelve gran parte de lo solicitado individualmente hasta ahora. Tener en cuenta que al solicitar todo lo anterior a la vez, en grandes dataframes esto puede demorar un poco.

Nota: El uso de memoria lo devuelve con el argumento deep en False.

In [45]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 74 entries, AMC Concord to Volvo 260
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   price         74 non-null     int64
 1   mpg           74 non-null     int64
 2   rep78         69 non-null     float64
 3   headroom      74 non-null     float64
 4   trunk         74 non-null     int64
 5   weight        74 non-null     int64
 6   length        74 non-null     int64
 7   turn          74 non-null     int64
 8   displacement  74 non-null     int64
 9   gear_ratio    74 non-null     float64
 10  foreig        74 non-null     object
dtypes: float64(3), int64(7), object(1)
memory usage: 6.9+ KB

**Contar valores NaN:**

In [46]:
df4.isnull().sum()

price           0
mpg             0
rep78           5
headroom        0
trunk           0
weight          0
length          0
turn            0
displacement    0
gear_ratio      0
foreig          0
dtype: int64

**Obtener valores únicos de una columna:**

In [47]:
df4['foreig'].unique()

array(['Domestic', 'Foreign'], dtype=object)

### Pandas - Seleccionar / SQL SELECT (PL/PgSQL)

**Primeras filas:**

In [48]:
df4.head() #Si head no recibe un número como argumento por defecto devuelve los primeros 5 valores.

,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
make,,,,,,,,,,,
AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic

SQL:

SELECT *
FROM auto
ORDER BY make
LIMIT 5;

Nota: El dataframe importado no está ordenado por el índice (make). Para tener exactamente el mismo output que en SQL, en Pandas habría ordenarlo de la siguiente manera.

In [49]:
df4.sort_values(by=['make']).head()

,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
make,,,,,,,,,,,
AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
Audi 5000,9690,17,5.0,3.0,15,2830,189,37,131,3.20,Foreign
Audi Fox,6295,23,3.0,2.5,11,2070,174,36,97,3.70,Foreign

sort_values: Nos permite ordenar nuestro dataframe por una o más columnas.

Sintaxis: 
    
- Orden ascendente:
        df.sort_values(by=["columna_1","columna_2"])
    
    
- Orden descendente:
        df.sort_values(by=["columna_1","columna_2"], ascending=False)
    
- Orden especificando posición de los valores NaN:
    - Al principio:
        df.sort_values(by=["columna_1","columna_2"], ascending=False, na_position="first")
            
    - Al final (opción default):
        df.sort_values(by=["columna_1","columna_2"], ascending=False, na_position="last")

**Últimas filas:**

In [50]:
df4.tail() #Si tail no recibe un número como argumento por defecto devuelve los últimos 5 valores.

,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
make,,,,,,,,,,,
VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign
VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign

SQL:

SELECT *
FROM auto
ORDER BY make desc
LIMIT 5;

/*Nota: El dataframe importado no está ordenado por el índice (make). Para tener exactamente el mismo output que en SQL, en Pandas habría ordenarlo de la siguiente manera.*/

In [51]:
df4.sort_values(by=['make'],ascending=False).head()

,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
make,,,,,,,,,,,
Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign
VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign

**Seleccionar columnas:**

* Una sola columna: Pandas devolvera una serie porque es un objeto más eficiente. En este ejemplo, la dimensión de la serie es "price" y "make" es su índice.

In [52]:
df4["price"]

make
AMC Concord       4099
AMC Pacer         4749
AMC Spirit        3799
Buick Century     4816
Buick Electra     7827
                 ...
VW Dasher         7140
VW Diesel         5397
VW Rabbit         4697
VW Scirocco       6850
Volvo 260        11995
Name: price, Length: 74, dtype: int64

Si quisiera un dataframe debería hacer lo siguiente:

In [53]:
df4["price"].to_frame()

               price
make
AMC Concord     4099
AMC Pacer       4749
AMC Spirit      3799
Buick Century   4816
Buick Electra   7827
...              ...
VW Dasher       7140
VW Diesel       5397
VW Rabbit       4697
VW Scirocco     6850
Volvo 260      11995

[74 rows x 1 columns]

La opción que vimos más arriba no es la más recomendable porque es poco intuitiva, vamos a preferir esta alternativa... que es seleccionar price dentro de una lista anidada, lo que nos ahorra el paso de convertirlo en DataFrame.

In [54]:
df4[["price"]]

               price
make
AMC Concord     4099
AMC Pacer       4749
AMC Spirit      3799
Buick Century   4816
Buick Electra   7827
...              ...
VW Dasher       7140
VW Diesel       5397
VW Rabbit       4697
VW Scirocco     6850
Volvo 260      11995

[74 rows x 1 columns]

SQL:

SELECT
	make,
	price
FROM auto;

Elegimos esta opción porque nos va a permitir seleccionar varias columnas...

* Varias columnas:

In [55]:
df4[["price","weight"]]

               price  weight
make
AMC Concord     4099    2930
AMC Pacer       4749    3350
AMC Spirit      3799    2640
Buick Century   4816    3250
Buick Electra   7827    4080
...              ...     ...
VW Dasher       7140    2160
VW Diesel       5397    2040
VW Rabbit       4697    1930
VW Scirocco     6850    1990
Volvo 260      11995    3170

[74 rows x 2 columns]

SQL:

SELECT
	make,
	price,
    weight
FROM auto;

También podemos selecccionar las columnas por su posición.

* Una sola columna:

In [56]:
df4.columns

Index(['price', 'mpg', 'rep78', 'headroom', 'trunk', 'weight', 'length',
       'turn', 'displacement', 'gear_ratio', 'foreig'],
      dtype='object')

In [57]:
df4.columns[0]

'price'

Como serie...

In [58]:
df4[df4.columns[0]]

make
AMC Concord       4099
AMC Pacer         4749
AMC Spirit        3799
Buick Century     4816
Buick Electra     7827
                 ...
VW Dasher         7140
VW Diesel         5397
VW Rabbit         4697
VW Scirocco       6850
Volvo 260        11995
Name: price, Length: 74, dtype: int64

Como dataframe...

In [59]:
df4[[df4.columns[0]]]

               price
make
AMC Concord     4099
AMC Pacer       4749
AMC Spirit      3799
Buick Century   4816
Buick Electra   7827
...              ...
VW Dasher       7140
VW Diesel       5397
VW Rabbit       4697
VW Scirocco     6850
Volvo 260      11995

[74 rows x 1 columns]

* Varias columnas:

In [60]:
df4[df4.columns[[0, 5]]] #Primera y sexta columna

               price  weight
make
AMC Concord     4099    2930
AMC Pacer       4749    3350
AMC Spirit      3799    2640
Buick Century   4816    3250
Buick Electra   7827    4080
...              ...     ...
VW Dasher       7140    2160
VW Diesel       5397    2040
VW Rabbit       4697    1930
VW Scirocco     6850    1990
Volvo 260      11995    3170

[74 rows x 2 columns]

En SQL puede ser bastante complicado seleccionar las columnas por su posición, pero si solo se quiere obtener los nombres de las columnas de la tabla (df4.columns):

SQL:

SELECT *
  FROM information_schema.columns
  WHERE table_schema = 'public'
  	AND table_name = 'auto'

/*Consulta escrita para Postgres SQL (P-SQL), esto puede variar en otras implementaciones como SQL Server (T-SQL).*/

**Selección de filas por rango:**

Sintaxis:
df[desde:hasta] (Recordar que el hasta es exclusive).

In [61]:
#Seleccionamos desde la 6 fila hasta la 24.
df4[5:25]

,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
make,,,,,,,,,,,
Buick LeSabre,5788,18,3.0,4.0,21,3670,218,43,231,2.73,Domestic
Buick Opel,4453,26,NaN,3.0,10,2230,170,34,304,2.87,Domestic
Buick Regal,5189,20,3.0,2.0,16,3280,200,42,196,2.93,Domestic
Buick Riviera,10372,16,3.0,3.5,17,3880,207,43,231,2.93,Domestic
Buick Skylark,4082,19,3.0,3.5,13,3400,200,42,231,3.08,Domestic
Cad. Deville,11385,14,3.0,4.0,20,4330,221,44,425,2.28,Domestic
Cad. Eldorado,14500,14,2.0,3.5,16,3900,204,43,350,2.19,Domestic
Cad. Seville,15906,21,3.0,3.0,13,4290,204,45,350,2.24,Domestic
Chev. Chevette,3299,29,3.0,2.5,9,2110,163,34,231,2.93,Domestic
Chev. Impala,5705,16,4.0,4.0,20,3690,212,43,250,2.56,Domestic
Chev. Malibu,4504,22,3.0,3.5,17,3180,193,31,200,2.73,Domestic
Chev. Monte Carlo,5104,22,2.0,2.0,16,3220,200,41,200,2.73,Domestic
Chev. Monza,3667,24,2.0,2.0,7,2750,179,40,151,2.73,Domestic
Chev. Nova,3955,19,3.0,3.5,13,3430,197,43,250,2.56,Domestic
Dodge Colt,3984,30,5.0,2.0,8,2120,163,35,98,3.54,Domestic
Dodge Diplomat,4010,18,2.0,4.0,17,3600,206,46,318,2.47,Domestic
Dodge Magnum,5886,16,2.0,4.0,17,3600,206,46,318,2.47,Domestic
Dodge St. Regis,6342,17,2.0,4.5,21,3740,220,46,225,2.94,Domestic
Ford Fiesta,4389,28,4.0,1.5,9,1800,147,33,98,3.15,Domestic
Ford Mustang,4187,21,3.0,2.0,10,2650,179,43,140,3.08,Domestic

SQL:

Para seleccionar por un rango en SQL necesito que el índice sea numérico.
Como actualmente make es el índice lo tengo que modificar con:

ALTER TABLE <table_name> DROP CONSTRAINT <table_name>_pkey; --Dropeo make como primary key.
ALTER TABLE <table_name> ADD COLUMN <id_column_name> SERIAL PRIMARY KEY;  --Agrego una columna id

ALTER TABLE auto DROP CONSTRAINT auto_pkey;
ALTER TABLE auto ADD COLUMN id SERIAL PRIMARY KEY;

Después de eso puedo hacer la consulta:

SELECT *
FROM auto
WHERE id >=6 AND id <=25

Otra manera:

SELECT *
FROM auto
WHERE id BETWEEN 6 AND 25

**Selección por label indexing (.loc)**:

El método .loc nos permite seleccionar elementos a partir de etiquetas.

Las sintaxis admitidas son las siguientes:

* df.loc[valor_buscado,"nombre_columna"]
* df.loc[["valor_buscado_1","valor_buscado_2"] , ["nombre_columna_1","nombre_columna_2"]]
* df.loc["valor_buscado_desde":"valor_buscado_hasta" , "nombre_columna_desde":"nombre_columna_hasta"]

Probemos cada una:

In [62]:
#Buscamos el precio del Buick Century
#df.loc[valor_buscado,"nombre_columna"]
df4.loc["Buick Century","price"]

4816

SQL:
    
SELECT price
FROM auto
WHERE
    make = 'Buick Century'

In [63]:
#Buscamos el precio y el peso del Buick Century y del VW Dasher
#df.loc[["valor_buscado_1","valor_buscado_2"] , ["nombre_columna_1","nombre_columna_2"]]
df4.loc[["Buick Century","VW Dasher"],["price","weight"]] #Notar la lista anidada

               price  weight
make
Buick Century   4816    3250
VW Dasher       7140    2160

SQL:

SELECT make,
       price,
	   weight
FROM auto
WHERE
	make = 'Buick Century' OR make = 'VW Dasher'

In [64]:
#Buscamos todas las columnas desde millas por galón (mpg) hasta capacidad del baúl (trunk)
#en los autos que van desde el AMC Spirit hasta el Buick Electra.

#df.loc["valor_buscado_desde":"valor_buscado_hasta" , "nombre_columna_desde":"nombre_columna_hasta"]
df4.loc["AMC Spirit":"Buick Electra", "mpg":"trunk"]

#Una curiosidad de .loc respecto a Python en general es que incluye el último elemento de un rango.

               mpg  rep78  headroom  trunk
make
AMC Spirit      22    NaN       3.0     12
Buick Century   20    3.0       4.5     16
Buick Electra   15    4.0       4.0     20

Esta consulta en SQL es más complicada, tenemos que hacer una subconsulta...

Empecemos por la subconsulta...

Vamos a buscar el id mínimo y máximo de los autos que buscamos.

El mínimo va a ser "AMC Spirit" porque es desde donde partimos nuestra búsqueda
y el máximo "Buick Electra" porque es hasta dónde buscamos.

SELECT
    min(id),
    max(id)
FROM
    auto
WHERE
    make IN ('AMC Spirit','Buick Electra')

![](files/min_max.png)

Venimos bien en esta pequeña tabla, llamémosla "B", tenemos el id mínimo y el máximo, nos falta lo que está en el medio. Ahora pasemos a la consulta general que vamos a llamar tabla "A".

SELECT
	make,            
	mpg,
	rep78,
	headroom,
	trunk                
FROM
  auto

![](files/query.png)

El problema de esta consulta es que contiene todas las observaciones, es decir que contiene el id mínimo, el máximo y lo que está en el medio, pero todo lo demás sobra. Lo que vamos a tener que hacer es unir esta gran consulta (Tabla A) con la subconsulta (Tabla B), conservando SOLAMENTE las observaciones que son mayores o iguales al id mínimo y las que son menores o iguales al id máximo.

SELECT
    A.make,                 ---Variables que queremos ver
    A.mpg,
	A.rep78,
	A.headroom,
	A.trunk                 ---Hasta acá las variables
FROM
  auto AS A
INNER JOIN                  ---JOIN (VER SU CONDICIÓN)
   (SELECT                  ---Acá empieza la subconsulta
		min(id),
		max(id)
    FROM
       auto
   WHERE
	make IN ('AMC Spirit','Buick Electra')) AS B --Acá termina 
   ON A.id >= B.min AND     ---CONDICIÓN DEL JOIN
      A.id <= B.max

![](files/query_con_min_max.png)

**Selección por integer indexing (.iloc)**:

El método .iloc nos permite seleccionar utilizando las posiciones, los números de índice de nuestras filas y columnas.

Las sintaxis admitidas son las siguientes:

* df.iloc[índice_fila_buscada_1,índice_columna_buscada_1]
* df.iloc[[índice_fila_buscada_1,índice_fila_buscada_2] , [índice_columna_buscada_1,índice_columna_buscada_2]]
* df.iloc[[índice_fila_buscada_1, índice_fila_buscad_2] , [índice_columna_buscada_1,índice_columna_buscada_2]]

Probemos cada una:

In [65]:
#Buscamos el valor de la columna con índice 7 en la fila con índice 4.
#df.iloc[índice_fila_buscada_1,índice_columna_buscada_1]
df4.iloc[4,7]

43

SQL:

SELECT
	turn
FROM auto
WHERE id = 5

In [66]:
#Buscamos los valores de las columnas con índice 1 y 7 en las filas con índice 4 y 12.
#df.iloc[[índice_fila_buscada_1,índice_fila_buscada_2] , [índice_columna_buscada_1,índice_columna_buscada_2]]
df4.iloc[[4,12],[1,7]]

               mpg  turn
make
Buick Electra   15    43
Cad. Seville    21    45

SQL:

SELECT
	make,
	mpg,
	turn
FROM auto
WHERE
id = 5
	OR
id = 13

In [67]:
#Buscamos los valores de las 4 últimas columnas en las filas con índice 3 a 8.
#df.iloc[[índice_fila_buscada_1, índice_fila_buscada_2] , [índice_columna_buscada_1,índice_columna_buscada_2]]
df4.iloc[3:8,-4:]

               turn  displacement  gear_ratio    foreig
make
Buick Century    40           196        2.93  Domestic
Buick Electra    43           350        2.41  Domestic
Buick LeSabre    43           231        2.73  Domestic
Buick Opel       34           304        2.87  Domestic
Buick Regal      42           196        2.93  Domestic

SQL:

SELECT
    make,
	turn,
	displacement,
	gear_ratio,
	foreig
FROM auto
WHERE
id BETWEEN 4 AND 8

Recuerden que si nos resulta más cómodo o necesitamos usar make como una columna podemos resetear el índice para obtener uno numérico como hicimos con las series al principio de la clase.

In [68]:
df4.reset_index(inplace=True)
df4

#Ahora make es una columna más...

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic
...,...,...,...,...,...,...,...,...,...,...,...,...
69,VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign
70,VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
71,VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
72,VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
73,Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign

**Selección en base a operaciones lógicas (WHERE - CASE):**

Al igual que NumPy, Pandas también puede realizar operaciones lógicas, recordemos sus operadores lógicos.

| Operador Python     | Operador NumPy/Pandas     |
|-----------------|:---------------------:|
| or     | <code>&#124;</code>     | 
| and     | &     |
| not     | ~     |  


Busquemos los autos que puedan recorrer 12 millas por galón de combustible (mpg):

In [69]:
df4["mpg"]==12

0     False
1     False
2     False
3     False
4     False
      ...
69    False
70    False
71    False
72    False
73    False
Name: mpg, Length: 74, dtype: bool

SQL:

/*Con CASE marcamos con 1 a los que cumplen la condición (True) y con 0 a lo que no (False) */

SELECT
	mpg, --Borrar "mpg," para tener un output igual a de Pandas
CASE
	WHEN (mpg = 12) THEN 1
	ELSE 0
END AS booleano
FROM auto;

¿Qué pasó? El output no fue el esperado... Pero Pandas está funcionando bien, lo que pasa es que con el código que escribimos nosotros preguntamos **SI** hay autos que cumplan esa condición pero no **CUÁLES**, por eso retorna una serie con booleanos según si la fila cumple o no la condición. 

Para hacer eso, tenemos que indicarle que seleccione del dataframe los autos que cumplan con esa condición:

In [70]:
df4[df4["mpg"]==12] #Ahora sí!

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
25,Linc. Continental,11497,12,3.0,3.5,22,4840,233,51,400,2.47,Domestic
26,Linc. Mark V,13594,12,3.0,2.5,18,4720,230,48,400,2.47,Domestic

SQL:
    
SELECT *
FROM auto
WHERE mpg = 12;

In [71]:
#Nombre de los autos y su precio (price), de aquellos que pesan más de 3000 libras y son de origen extranjero

#Usamos .loc [Filas que cumplen la condición, etiqueta de columna]
df4.loc[(df4["weight"] > 3000) & (df4["foreig"] == "Foreign"),["make","price"]]

           make  price
63  Peugeot 604  12990
73    Volvo 260  11995

SQL:
    
SELECT
	make,
	price
FROM auto
WHERE weight > 3000 AND foreig = 'Foreign'

In [72]:
#Nombre de los autos, capacidad del baúl (trunk) y millas por galón (mpg)
#de aquellos con capacidad de baúl igual a 18 o que millas por galón sea mayor
#a 40

#[Filas que cumplen la condición, etiquetas de columna]
df4.loc[(df4["trunk"] == 18) | (df4["mpg"] >= 40),["make","trunk","mpg"]]

            make  trunk  mpg
26  Linc. Mark V     18   12
70     VW Diesel     15   41

SQL:

SELECT
    make,
    trunk,
    mpg
FROM auto
WHERE trunk = 18 OR mpg >=40

In [73]:
#Marca, precio y origen del los 10 primeros autos 10 autos que
#no sean de origen extranjero usando operador not.
df4.loc[~(df4["foreig"] == "Foreign"),["make","price","foreig"]].head(10)

            make  price    foreig
0    AMC Concord   4099  Domestic
1      AMC Pacer   4749  Domestic
2     AMC Spirit   3799  Domestic
3  Buick Century   4816  Domestic
4  Buick Electra   7827  Domestic
5  Buick LeSabre   5788  Domestic
6     Buick Opel   4453  Domestic
7    Buick Regal   5189  Domestic
8  Buick Riviera  10372  Domestic
9  Buick Skylark   4082  Domestic

SQL:

SELECT
    make,
    price,
    foreig
FROM auto
WHERE NOT foreig = 'Foreign'
LIMIT 10

El método **isin** es un **or** múltiple de igualdad y nos puede ahorrar escribir mucho código.

Escribir esto puede ser bastante insufrible.

In [74]:
#Selecciono marca y millas por galón (mpg) de autos cuyo mpg sea 14, 20, 28, 34 ó 41.
df4.loc[(df4["mpg"] == 14) |
        (df4["mpg"] == 20) |
        (df4["mpg"] == 28) |
        (df4["mpg"] == 34) |
        (df4["mpg"] == 41)
        ,["make","mpg"]]

                make  mpg
3      Buick Century   20
7        Buick Regal   20
10      Cad. Deville   14
11     Cad. Eldorado   14
23       Ford Fiesta   28
27  Linc. Versailles   14
29      Merc. Cougar   14
32        Merc. XR-7   14
33      Merc. Zephyr   20
41       Plym. Arrow   28
42       Plym. Champ   34
61       Honda Civic   28
63       Peugeot 604   14
70         VW Diesel   41

Entonces usamos **isin** para consultar si hay autos que ese encuentra en una lista de valores de mpg.

In [75]:
#Selecciono marca y millas por galón (mpg) de autos cuyo mpg sea 14, 20, 28, 34 ó 41.
df4.loc[df4["mpg"].isin([14,20,28,34,41]),["make","mpg"]]

                make  mpg
3      Buick Century   20
7        Buick Regal   20
10      Cad. Deville   14
11     Cad. Eldorado   14
23       Ford Fiesta   28
27  Linc. Versailles   14
29      Merc. Cougar   14
32        Merc. XR-7   14
33      Merc. Zephyr   20
41       Plym. Arrow   28
42       Plym. Champ   34
61       Honda Civic   28
63       Peugeot 604   14
70         VW Diesel   41

SQL:

SELECT
	make,
	mpg
FROM auto
WHERE
	mpg IN(14,20,28,34,41)

Las operaciones lógicas que vimos hasta ahora también nos permiten hacer comparaciones entre columnas.

In [76]:
#Seleccionamos las filas en que la cilindrada (displacement) sea mayor que
#la longitud del auto (length)
df4[df4["displacement"] > df4["length"]]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic
5,Buick LeSabre,5788,18,3.0,4.0,21,3670,218,43,231,2.73,Domestic
6,Buick Opel,4453,26,NaN,3.0,10,2230,170,34,304,2.87,Domestic
8,Buick Riviera,10372,16,3.0,3.5,17,3880,207,43,231,2.93,Domestic
9,Buick Skylark,4082,19,3.0,3.5,13,3400,200,42,231,3.08,Domestic
10,Cad. Deville,11385,14,3.0,4.0,20,4330,221,44,425,2.28,Domestic
11,Cad. Eldorado,14500,14,2.0,3.5,16,3900,204,43,350,2.19,Domestic
12,Cad. Seville,15906,21,3.0,3.0,13,4290,204,45,350,2.24,Domestic
13,Chev. Chevette,3299,29,3.0,2.5,9,2110,163,34,231,2.93,Domestic
14,Chev. Impala,5705,16,4.0,4.0,20,3690,212,43,250,2.56,Domestic
15,Chev. Malibu,4504,22,3.0,3.5,17,3180,193,31,200,2.73,Domestic
18,Chev. Nova,3955,19,3.0,3.5,13,3430,197,43,250,2.56,Domestic
20,Dodge Diplomat,4010,18,2.0,4.0,17,3600,206,46,318,2.47,Domestic
21,Dodge Magnum,5886,16,2.0,4.0,17,3600,206,46,318,2.47,Domestic
22,Dodge St. Regis,6342,17,2.0,4.5,21,3740,220,46,225,2.94,Domestic
25,Linc. Continental,11497,12,3.0,3.5,22,4840,233,51,400,2.47,Domestic
26,Linc. Mark V,13594,12,3.0,2.5,18,4720,230,48,400,2.47,Domestic
27,Linc. Versailles,13466,14,3.0,3.5,15,3830,201,41,302,2.47,Domestic
29,Merc. Cougar,5379,14,4.0,3.5,16,4060,221,48,302,2.75,Domestic
30,Merc. Marquis,6165,15,3.0,3.5,23,3720,212,44,302,2.26,Domestic
31,Merc. Monarch,4516,18,3.0,3.0,15,3370,198,41,250,2.43,Domestic
32,Merc. XR-7,6303,14,4.0,3.0,16,4130,217,45,302,2.75,Domestic
34,Olds 98,8814,21,4.0,4.0,20,4060,220,43,350,2.41,Domestic
35,Olds Cutl Supr,5172,19,3.0,2.0,16,3310,198,42,231,2.93,Domestic
36,Olds Cutlass,4733,19,3.0,4.5,16,3300,198,42,231,2.93,Domestic
37,Olds Delta 88,4890,18,4.0,4.0,20,3690,218,42,231,2.73,Domestic
38,Olds Omega,4181,19,3.0,4.5,14,3370,200,43,231,3.08,Domestic
40,Olds Toronado,10371,16,3.0,3.5,17,4030,206,43,350,2.41,Domestic
45,Plym. Volare,4060,18,2.0,5.0,16,3330,201,44,225,3.23,Domestic
46,Pont. Catalina,5798,18,4.0,4.0,20,3700,214,42,231,2.73,Domestic
47,Pont. Firebird,4934,18,1.0,1.5,7,3470,198,42,231,3.08,Domestic
48,Pont. Grand Prix,5222,19,3.0,2.0,16,3210,201,45,231,2.93,Domestic
49,Pont. Le Mans,4723,19,3.0,3.5,17,3200,199,40,231,2.93,Domestic
50,Pont. Phoenix,4424,19,NaN,3.5,13,3420,203,43,231,3.08,Domestic

SQL:

SELECT
    make,
    mpg
FROM auto
WHERE
    displacement > length

**Obtener estadísticos**

.describe() permite obtener rápidamente los estadísticos de todas las columnas numéricas, cabe aclarar que no incluye a los valores nan.

In [77]:
df4.describe()

,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio
count,74.000000,74.000000,69.000000,74.000000,74.000000,74.000000,74.000000,74.000000,74.000000,74.000000
mean,6165.256757,21.297297,3.405797,2.993243,13.756757,3019.459459,187.932432,39.648649,197.297297,3.014865
std,2949.495885,5.785503,0.989932,0.845995,4.277404,777.193567,22.266340,4.399354,91.837219,0.456287
min,3291.000000,12.000000,1.000000,1.500000,5.000000,1760.000000,142.000000,31.000000,79.000000,2.190000
25%,4220.250000,18.000000,3.000000,2.500000,10.250000,2250.000000,170.000000,36.000000,119.000000,2.730000
50%,5006.500000,20.000000,3.000000,3.000000,14.000000,3190.000000,192.500000,40.000000,196.000000,2.955000
75%,6332.250000,24.750000,4.000000,3.500000,16.750000,3600.000000,203.750000,43.000000,245.250000,3.352500
max,15906.000000,41.000000,5.000000,5.000000,23.000000,4840.000000,233.000000,51.000000,425.000000,3.890000

**Agrupar por (Group By):**

Con Pandas podemos agrupar los datos a partir de los valores de las columnas. 

Por ejemplo, intentemos obtener la cantidad de datos según el origen (foreig) y la cantidad de reparaciones efectuadas en 1978 (rep78).

In [78]:
(df4.groupby(["foreig","rep78"])
    .size()
    .to_frame(name="count") #Para que devuelva un df en lugar de una serie así es más legible
)

                count
foreig   rep78
Domestic 1.0        2
         2.0        8
         3.0       27
         4.0        9
         5.0        2
Foreign  3.0        3
         4.0        9
         5.0        9

SQL:
    
SELECT
	foreig,
	rep78,
	COUNT(*)
FROM auto
WHERE
	foreig IS NOT null
	AND
	rep78 IS NOT null	
GROUP BY
	foreig,
	rep78
ORDER BY
	foreig,
	rep78

Tenemos varias funciones de agregación que podemos aplicar a nuestros datos, algunas de ellas son:

 |    Agregación   |      Descripción                 |
 |-----------------|:--------------------------------:|
 | count()         | Contar el número de casos        |
 | first(), last() | Primer y último item             |
 | mean(), median()| Media, Mediana                   |
 | min(), max()    | Mínimo y Máximo                  |
 | std(), var()    | Varianza y desvio                |
 | mad()           | Desviación absoluta de la mediana|
 | prod()          | Producto de los items            |
 | sum()           | Suma de los Casos                |
 
Tengamos en cuenta que el comportamiento de Pandas por default es ignorar los NaN (skipna=True). Este comportamiento es opuesto al de Numpy, recordemos que para calcular el promedio en un array con algún valor NaN teníamos que usar la función nanmean para este no nos devolviese un promedio con valor NaN. Si el resultado de una agrupación es NaN es porque toda nuestra columna asumía valores NaN.

In [79]:
#Media de precio, rep78 y mpg según origen.
df4.groupby(["foreig"])[["price","rep78","mpg"]].mean()

                price     rep78        mpg
foreig
Domestic  6072.423077  3.020833  19.826923
Foreign   6384.681818  4.285714  24.772727

SQL:

SELECT 
	foreig,
	round(avg(price),6),
	round(avg(rep78)::numeric,6),
	round(avg(mpg),6)
FROM
	auto
group by
	foreig

Pero atención, rep78 tiene valores nan:

In [80]:
df4["rep78"][df4["rep78"].isnull()==True]

2    NaN
6    NaN
44   NaN
50   NaN
63   NaN
Name: rep78, dtype: float64

SQL:

SELECT
	id,
	rep78
FROM
	auto
WHERE
	rep78 IS NULL

Otras formas de seleccionar filas con valores NaN...

https://datatofish.com/rows-with-nan-pandas-dataframe/

In [81]:
df4_nan= df4[df4.isnull().any(axis=1)]
df4_nan

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
6,Buick Opel,4453,26,NaN,3.0,10,2230,170,34,304,2.87,Domestic
44,Plym. Sapporo,6486,26,NaN,1.5,8,2520,182,38,119,3.54,Domestic
50,Pont. Phoenix,4424,19,NaN,3.5,13,3420,203,43,231,3.08,Domestic
63,Peugeot 604,12990,14,NaN,3.5,14,3420,192,38,163,3.58,Foreign

SELECT
	make, price, mpg, rep78, headroom, trunk, weight,
	length, turn, displacement, gear_ratio, foreig
FROM (
    SELECT * FROM auto WHERE make IS NULL
    UNION
    SELECT * FROM auto WHERE price IS NULL
    UNION
    SELECT * FROM auto WHERE mpg IS NULL
    UNION
    SELECT * FROM auto WHERE rep78 IS NULL
    UNION
    SELECT * FROM auto WHERE headroom IS NULL
    UNION
    SELECT * FROM auto WHERE trunk IS NULL
    UNION
    SELECT * FROM auto WHERE weight IS NULL
    UNION
    SELECT * FROM auto WHERE length IS NULL
    UNION
    SELECT * FROM auto WHERE turn IS NULL
    UNION
    SELECT * FROM auto WHERE displacement IS NULL
    UNION
    SELECT * FROM auto WHERE gear_ratio IS NULL
    UNION
    SELECT * FROM auto WHERE foreig IS NULL
    ORDER BY
        id
) AS nulos

![](files/subset_null_sql.png)

Siguiendo con el tema de agrupación, este es el funcionamiento interno de Pandas al calcular una suma por grupo:

![](files/groupby-example.png)

**Calcular medidas resúmenes por grupo:**

.aggregate() o su alias .agg() nos permite obtener distintas medidas pasándo la medida solicitada como un string.

In [82]:
#Obtener mínimo, máximo, media y desvío estándar por origen

(df4[["price","foreig"]]
    .groupby(["foreig"])
    .agg(["min","max","mean","std"])
)

         price
           min    max         mean          std
foreig
Domestic  3291  15906  6072.423077  3097.104279
Foreign   3748  12990  6384.681818  2621.915083

SQL:

SELECT
	foreig,
	min(price), 
	max(price), 
	round(avg(price),6) AS mean, 
	round(stddev(price),6) AS std 
FROM
	auto
GROUP BY
	foreig

Si utilizamos el método select_dtypes seleccionar columnas por su tipo. Probemos eligiendo todas las columnas int64. 
* Podemos usar el tipo de dato específico (float64, int64, object, category, etc.)
* Podemos seleccionar todas las numéricas con: numeric
* Se recomienda leer la documentación para más alternativas:
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.select_dtypes.html

In [83]:
df4.select_dtypes(include=["int64"])

    price  mpg  trunk  weight  length  turn  displacement
0    4099   22     11    2930     186    40           121
1    4749   17     11    3350     173    40           258
2    3799   22     12    2640     168    35           121
3    4816   20     16    3250     196    40           196
4    7827   15     20    4080     222    43           350
..    ...  ...    ...     ...     ...   ...           ...
69   7140   23     12    2160     172    36            97
70   5397   41     15    2040     155    35            90
71   4697   25     15    1930     155    35            89
72   6850   25     16    1990     156    36            97
73  11995   17     14    3170     193    37           163

[74 rows x 7 columns]

Sin embargo, con select_dtypes puede ser un poco rebuscado usar group by y tener un buen output.

In [84]:
(df4.select_dtypes(include=['int64'])   #Selecciono solo las int64
    .join(df4["foreig"])                #Recupero la columna string "foreig"
    .groupby(["foreig"])                #Agrupo
    .agg(["min","max","mean","std"])
    .stack()                            #El resultado es una base muy ancha, le cambio la forma.
)

                      price        mpg      trunk       weight      length  \
foreig
Domestic min    3291.000000  12.000000   7.000000  1800.000000  147.000000
         max   15906.000000  34.000000  23.000000  4840.000000  233.000000
         mean   6072.423077  19.826923  14.750000  3317.115385  196.134615
         std    3097.104279   4.743297   4.306288   695.363740   20.046054
Foreign  min    3748.000000  14.000000   5.000000  1760.000000  142.000000
         max   12990.000000  41.000000  16.000000  3420.000000  193.000000
         mean   6384.681818  24.772727  11.409091  2315.909091  168.545455
         std    2621.915083   6.611187   3.216906   433.003454   13.682548

                    turn  displacement
foreig
Domestic min   31.000000     86.000000
         max   51.000000    425.000000
         mean  41.442308    233.711538
         std    3.967582     85.262993
Foreign  min   32.000000     79.000000
         max   38.000000    163.000000
         mean  35.409091    111.227273
         std    1.501082     24.880537

**Calcular diferentes medidas resúmenes para distintas variables**

Hay varias sintaxis admitidas para hacer esto, algunas devolverán outputs idénticos o similares. Es importante leer la documentación para usar la forma que mejor se adapte a nuestras necesidades.

* Creando explícitamente la columna con su respectiva medida con el nombre de la columna y la medida como tupla:

    **Sintaxis:**
    
    (df
        .groupby(["variables","de","agrupación"])
            .agg(nueva_columna=("variable",("medida_resumen")
            )
     )

In [85]:
#Obtener mínimo y máximo del precio y la media y el desvío estándar de mpg por origen.
(df4.groupby(["foreig"])
     .agg(
            min_price=("price", "min"),
            max_price=("price", "max"),
            mean_mpg=("mpg", 'mean'),
            std_mpg=("mpg", "std")
        )
)

          min_price  max_price   mean_mpg   std_mpg
foreig
Domestic       3291      15906  19.826923  4.743297
Foreign        3748      12990  24.772727  6.611187

* Creando columnas a partir de un diccionario donde su clave sea la variable elegida y su valor sea la medida resumen o una lista de medidas resúmen:

    **Sintaxis:**

     (df
        .groupby(["variables","de","agrupación"])
            .agg({
                "variable_1": ["medida_resumen_1", "medida_resumen_2"],
                "variable_2":["medida_resumen_3", "medida_resumen_4"]
            })
    )

In [86]:
#Obtener mínimo y máximo del precio y la media y el desvío estándar de mpg por origen.
(df4.groupby(["foreig"])
    .agg({
        "price": ["min", "max"],
        "mpg":["mean", "std"]
    })
)

         price               mpg
           min    max       mean       std
foreig
Domestic  3291  15906  19.826923  4.743297
Foreign   3748  12990  24.772727  6.611187

Esta última sintaxis puede ser muy cómoda a la hora de solicitar varias medidas resumen pero tiene como resultado un output un poco incómodo si después tenemos que seguir manipulando el dataframe. Por eso siempre tenemos que tener en nuestra cabeza el output que esperamos y trabajar en consecuencia.

In [87]:
(df4
    .groupby(["foreig"])
    .agg({
        "price": ["min", "max"],
        "mpg":["mean", "std"]
        })
).columns

MultiIndex([('price',  'min'),
            ('price',  'max'),
            (  'mpg', 'mean'),
            (  'mpg',  'std')],
           )

SQL:

SELECT
	foreig,
	round(min(price),6) AS price_min,
	round(max(price),6) AS price_max,
	round(avg(mpg),6) AS mpg_mean,
	round(stddev(mpg),6) AS mpg_std
FROM
	auto
GROUP BY
	foreig

**Filtrando el output (HAVING)**

En el apartado "*Selección en base a operaciones lógicas (WHERE - CASE)*" vimos que podíamos establecer ciertas condiciones al momento seleccionar datos de nuestro dataframe.

Es decir que nosotros filtrábamos los datos **ANTES** de aplicar cualquier agrupamiento (DE ENTRADA) ¿Pero qué pasa si queremos filtrar **DESPUÉS** de agrupar? (A LA SALIDA, ANTES DE OBTENER NUESTRA TABLA FINAL)

En SQL esta diferencia se ve muy claro, supongamos el siguiente ejemplo:

Queremos contar la cantidad de reparaciones por origen, pero solo nos interesa aquellos casos que tienen más 5 reparaciones. Entonces con lo que hasta ahora sabemos de SQL haríamos lo siguiente:

SQL:

SELECT
	foreig,
	rep78,
	count(*)
FROM
	auto
WHERE 
	count >5
GROUP BY
	foreig,
	rep78
ORDER BY
	foreig,
	rep78

Pero no, esto está mal y vamos a recibir el siguiente error.

ERROR:  no existe la columna «count»
LINE 8:  count >5
         ^
SQL state: 42703
Character: 54

Sucede que la columna count no existe dentro de la tabla auto, es una columna virtual, se calcula en la consulta "on the fly", en el momento que ejecutamos la consulta. Necesitamos usar la cláusula HAVING, la cual va precedida por el groupby.

SQL:

SELECT
	foreig,
	rep78,
	COUNT(*)
FROM
	auto
GROUP BY
	foreig,
	rep78
HAVING
	COUNT(*)>5
ORDER BY
	foreig,
	rep78

¡Ahora sí!

<div> <img src="files/having.png" width="300"/> </div>

Una forma equivalente de hacer esto en Pandas en 2 pasos podría ser:

    1) Agrupamos:

In [88]:
df5 = (df4[['foreig','rep78']]               #Selecciono foreig y rep78
        .reset_index()                       #Reseteo índice para aplicar groupby
        .groupby(['foreig','rep78'])         #Agrupo
        .count()                             #Cuento
        .rename(columns={"index":"count"})   #Renombro
        .reset_index()                       #Reseteo índice
      )                      
df5

     foreig  rep78  count
0  Domestic    1.0      2
1  Domestic    2.0      8
2  Domestic    3.0     27
3  Domestic    4.0      9
4  Domestic    5.0      2
5   Foreign    3.0      3
6   Foreign    4.0      9
7   Foreign    5.0      9

    2) Filtramos la salida:

In [89]:
df5.loc[(df5["count"] > 5)] #Filtro los que son menores que 5

     foreig  rep78  count
1  Domestic    2.0      8
2  Domestic    3.0     27
3  Domestic    4.0      9
6   Foreign    4.0      9
7   Foreign    5.0      9

Con un poco de práctica también podemos hacerlo en un solo paso.

In [90]:
(df4[['foreig','rep78']]               #Selecciono foreig y rep78
    .reset_index()                     #Reseteo índice para aplicar groupby
    .groupby(['foreig','rep78'])       #Agrupo
    .count()                           #Cuento
    .rename(columns={"index":"count"}) #Renombro
    .loc[lambda x: x["count"] > 5]     #Filtro los que son menores que 5
    .reset_index()                     #Reseteo índice
)

     foreig  rep78  count
0  Domestic    2.0      8
1  Domestic    3.0     27
2  Domestic    4.0      9
3   Foreign    4.0      9
4   Foreign    5.0      9

**Índices múltiples (multi index)**:

Las columnas por las que agrupemos serán nuestro nuevo índice. En este caso foreig, headroom y rep78 son los índices.

In [91]:
(df4
    .groupby(["foreig","headroom","rep78"])
        [["price","mpg","weight"]]
        .mean()
)

                                price        mpg       weight
foreig   headroom rep78
Domestic 1.5      1.0     4934.000000  18.000000  3470.000000
                  4.0     4389.000000  28.000000  1800.000000
         2.0      1.0     4195.000000  24.000000  2730.000000
                  2.0     4314.333333  23.333333  2886.666667
                  3.0     4883.400000  21.400000  3142.000000
                  5.0     3984.000000  30.000000  2120.000000
         2.5      3.0     6997.333333  21.000000  3253.333333
                  5.0     4425.000000  34.000000  1800.000000
         3.0      3.0     8390.333333  18.666667  3670.000000
                  4.0     5066.000000  18.000000  3355.000000
         3.5      2.0    14500.000000  14.000000  3900.000000
                  3.0     7242.600000  17.200000  3634.000000
                  4.0     5379.000000  14.000000  4060.000000
         4.0      2.0     4948.000000  17.000000  3600.000000
                  3.0     7218.333333  19.000000  3400.000000
                  4.0     6606.800000  17.600000  3844.000000
         4.5      2.0     6342.000000  17.000000  3740.000000
                  3.0     4576.666667  19.333333  3306.666667
         5.0      2.0     4060.000000  18.000000  3330.000000
Foreign  1.5      4.0     6229.000000  23.000000  2370.000000
         2.0      4.0     6850.000000  25.000000  1990.000000
                  5.0     5154.000000  26.500000  2345.000000
         2.5      3.0     5295.500000  22.000000  2100.000000
                  4.0     6916.400000  24.200000  2320.000000
                  5.0     7230.666667  23.333333  2543.333333
         3.0      3.0     3895.000000  26.000000  1830.000000
                  4.0     4697.000000  25.000000  1930.000000
                  5.0     6158.500000  28.500000  2327.500000
         3.5      4.0     3995.000000  30.000000  1980.000000

Podemos verificarlo así:

In [92]:
(df4.groupby(["foreig","headroom","rep78"])[["price","mpg","weight"]]
     .mean()
     .index)

MultiIndex([('Domestic', 1.5, 1.0),
            ('Domestic', 1.5, 4.0),
            ('Domestic', 2.0, 1.0),
            ('Domestic', 2.0, 2.0),
            ('Domestic', 2.0, 3.0),
            ('Domestic', 2.0, 5.0),
            ('Domestic', 2.5, 3.0),
            ('Domestic', 2.5, 5.0),
            ('Domestic', 3.0, 3.0),
            ('Domestic', 3.0, 4.0),
            ('Domestic', 3.5, 2.0),
            ('Domestic', 3.5, 3.0),
            ('Domestic', 3.5, 4.0),
            ('Domestic', 4.0, 2.0),
            ('Domestic', 4.0, 3.0),
            ('Domestic', 4.0, 4.0),
            ('Domestic', 4.5, 2.0),
            ('Domestic', 4.5, 3.0),
            ('Domestic', 5.0, 2.0),
            ( 'Foreign', 1.5, 4.0),
            ( 'Foreign', 2.0, 4.0),
            ( 'Foreign', 2.0, 5.0),
            ( 'Foreign', 2.5, 3.0),
            ( 'Foreign', 2.5, 4.0),
            ( 'Foreign', 2.5, 5.0),
            ( 'Foreign', 3.0, 3.0),
            ( 'Foreign', 3.0, 4.0),
            ( 'Foreign', 3.0, 5.0),
            ( 'Foreign', 3.5, 4.0)],
           names=['foreig', 'headroom', 'rep78'])

**Cambiando la estructura del dataframe (reshaping):**

Pandas ofrece varios métodos cambiar las estructura de un dataframe, nosotros veremos pivot, stack y unstack.

***1. Pivot:***

Cambia la estructura de nuestro dataframe eligiendo qué columnas serán índice, columnas simples y cuáles serán los valores a expresar.

Esquema:

<div> <img src="files/pivot-table-datasheet.png" width="600"/> </div>

In [93]:
#Creamos und df con una selección de variables a pivotar
df6 = df4[["make","rep78","foreig","price"]]
df6

             make  rep78    foreig  price
0     AMC Concord    3.0  Domestic   4099
1       AMC Pacer    3.0  Domestic   4749
2      AMC Spirit    NaN  Domestic   3799
3   Buick Century    3.0  Domestic   4816
4   Buick Electra    4.0  Domestic   7827
..            ...    ...       ...    ...
69      VW Dasher    4.0   Foreign   7140
70      VW Diesel    5.0   Foreign   5397
71      VW Rabbit    4.0   Foreign   4697
72    VW Scirocco    4.0   Foreign   6850
73      Volvo 260    5.0   Foreign  11995

[74 rows x 4 columns]

In [94]:
(df6.pivot(index=["make","foreig"],
           columns=["rep78"],
           values=["price"])
)

                       price
rep78                    NaN 1.0 2.0     3.0     4.0      5.0
make        foreig
AMC Concord Domestic     NaN NaN NaN  4099.0     NaN      NaN
AMC Pacer   Domestic     NaN NaN NaN  4749.0     NaN      NaN
AMC Spirit  Domestic  3799.0 NaN NaN     NaN     NaN      NaN
Audi 5000   Foreign      NaN NaN NaN     NaN     NaN   9690.0
Audi Fox    Foreign      NaN NaN NaN  6295.0     NaN      NaN
...                      ...  ..  ..     ...     ...      ...
VW Dasher   Foreign      NaN NaN NaN     NaN  7140.0      NaN
VW Diesel   Foreign      NaN NaN NaN     NaN     NaN   5397.0
VW Rabbit   Foreign      NaN NaN NaN     NaN  4697.0      NaN
VW Scirocco Foreign      NaN NaN NaN     NaN  6850.0      NaN
Volvo 260   Foreign      NaN NaN NaN     NaN     NaN  11995.0

[74 rows x 6 columns]

<div> <img src="files/pivot.jpg" width="400"/> </div>

https://www.youtube.com/watch?v=8w3wmQAMoxQ

***2. Stack:***
    
Nos permite cambiar la forma de nuestro dataframe pasando las columnas (que no son índice) a filas. Nos va a devolver una Serie, nosotros la vamos a convertir en un dataframe para mejorar el output.

Este es el esquema de la operación que realiza stack:

<div> <img src="files/reshaping_stack.png" width="500"/> </div>

In [95]:
#Creamos un dataframe para probar stack
df7 = df4.groupby(["foreig","headroom","rep78"])[["price","mpg","weight"]].mean()
df7

                                price        mpg       weight
foreig   headroom rep78
Domestic 1.5      1.0     4934.000000  18.000000  3470.000000
                  4.0     4389.000000  28.000000  1800.000000
         2.0      1.0     4195.000000  24.000000  2730.000000
                  2.0     4314.333333  23.333333  2886.666667
                  3.0     4883.400000  21.400000  3142.000000
                  5.0     3984.000000  30.000000  2120.000000
         2.5      3.0     6997.333333  21.000000  3253.333333
                  5.0     4425.000000  34.000000  1800.000000
         3.0      3.0     8390.333333  18.666667  3670.000000
                  4.0     5066.000000  18.000000  3355.000000
         3.5      2.0    14500.000000  14.000000  3900.000000
                  3.0     7242.600000  17.200000  3634.000000
                  4.0     5379.000000  14.000000  4060.000000
         4.0      2.0     4948.000000  17.000000  3600.000000
                  3.0     7218.333333  19.000000  3400.000000
                  4.0     6606.800000  17.600000  3844.000000
         4.5      2.0     6342.000000  17.000000  3740.000000
                  3.0     4576.666667  19.333333  3306.666667
         5.0      2.0     4060.000000  18.000000  3330.000000
Foreign  1.5      4.0     6229.000000  23.000000  2370.000000
         2.0      4.0     6850.000000  25.000000  1990.000000
                  5.0     5154.000000  26.500000  2345.000000
         2.5      3.0     5295.500000  22.000000  2100.000000
                  4.0     6916.400000  24.200000  2320.000000
                  5.0     7230.666667  23.333333  2543.333333
         3.0      3.0     3895.000000  26.000000  1830.000000
                  4.0     4697.000000  25.000000  1930.000000
                  5.0     6158.500000  28.500000  2327.500000
         3.5      4.0     3995.000000  30.000000  1980.000000

In [96]:
df7 = df7.stack().to_frame(name="Valor") #Cambio el nombre de la columna 0
df7

                                 Valor
foreig   headroom rep78
Domestic 1.5      1.0   price   4934.0
                        mpg       18.0
                        weight  3470.0
                  4.0   price   4389.0
                        mpg       28.0
...                                ...
Foreign  3.0      5.0   mpg       28.5
                        weight  2327.5
         3.5      4.0   price   3995.0
                        mpg       30.0
                        weight  1980.0

[87 rows x 1 columns]

***3. Unstack:***

Si quisiéramos desarmar estos índices para cambiar la forma de nuestro dataframe podríamos hacerlo con unstack(). Este método por defecto elimina el último índice de las filas (-1) y pasa a ser el índice de las columnas.

<div> <img src="files/reshaping_unstack.png" width="500"/> </div>

In [97]:
#Creamos un dataframe para probar unstack
df8 = df4.groupby(["foreig","headroom","rep78"])[["price","mpg","weight"]].mean() 
df8

                                price        mpg       weight
foreig   headroom rep78
Domestic 1.5      1.0     4934.000000  18.000000  3470.000000
                  4.0     4389.000000  28.000000  1800.000000
         2.0      1.0     4195.000000  24.000000  2730.000000
                  2.0     4314.333333  23.333333  2886.666667
                  3.0     4883.400000  21.400000  3142.000000
                  5.0     3984.000000  30.000000  2120.000000
         2.5      3.0     6997.333333  21.000000  3253.333333
                  5.0     4425.000000  34.000000  1800.000000
         3.0      3.0     8390.333333  18.666667  3670.000000
                  4.0     5066.000000  18.000000  3355.000000
         3.5      2.0    14500.000000  14.000000  3900.000000
                  3.0     7242.600000  17.200000  3634.000000
                  4.0     5379.000000  14.000000  4060.000000
         4.0      2.0     4948.000000  17.000000  3600.000000
                  3.0     7218.333333  19.000000  3400.000000
                  4.0     6606.800000  17.600000  3844.000000
         4.5      2.0     6342.000000  17.000000  3740.000000
                  3.0     4576.666667  19.333333  3306.666667
         5.0      2.0     4060.000000  18.000000  3330.000000
Foreign  1.5      4.0     6229.000000  23.000000  2370.000000
         2.0      4.0     6850.000000  25.000000  1990.000000
                  5.0     5154.000000  26.500000  2345.000000
         2.5      3.0     5295.500000  22.000000  2100.000000
                  4.0     6916.400000  24.200000  2320.000000
                  5.0     7230.666667  23.333333  2543.333333
         3.0      3.0     3895.000000  26.000000  1830.000000
                  4.0     4697.000000  25.000000  1930.000000
                  5.0     6158.500000  28.500000  2327.500000
         3.5      4.0     3995.000000  30.000000  1980.000000

In [98]:
df8 = df8.unstack()
df8

                    price                                                  \
rep78                 1.0           2.0          3.0     4.0          5.0
foreig   headroom
Domestic 1.5       4934.0           NaN          NaN  4389.0          NaN
         2.0       4195.0   4314.333333  4883.400000     NaN  3984.000000
         2.5          NaN           NaN  6997.333333     NaN  4425.000000
         3.0          NaN           NaN  8390.333333  5066.0          NaN
         3.5          NaN  14500.000000  7242.600000  5379.0          NaN
         4.0          NaN   4948.000000  7218.333333  6606.8          NaN
         4.5          NaN   6342.000000  4576.666667     NaN          NaN
         5.0          NaN   4060.000000          NaN     NaN          NaN
Foreign  1.5          NaN           NaN          NaN  6229.0          NaN
         2.0          NaN           NaN          NaN  6850.0  5154.000000
         2.5          NaN           NaN  5295.500000  6916.4  7230.666667
         3.0          NaN           NaN  3895.000000  4697.0  6158.500000
         3.5          NaN           NaN          NaN  3995.0          NaN

                    mpg                                         weight  \
rep78               1.0        2.0        3.0   4.0        5.0     1.0
foreig   headroom
Domestic 1.5       18.0        NaN        NaN  28.0        NaN  3470.0
         2.0       24.0  23.333333  21.400000   NaN  30.000000  2730.0
         2.5        NaN        NaN  21.000000   NaN  34.000000     NaN
         3.0        NaN        NaN  18.666667  18.0        NaN     NaN
         3.5        NaN  14.000000  17.200000  14.0        NaN     NaN
         4.0        NaN  17.000000  19.000000  17.6        NaN     NaN
         4.5        NaN  17.000000  19.333333   NaN        NaN     NaN
         5.0        NaN  18.000000        NaN   NaN        NaN     NaN
Foreign  1.5        NaN        NaN        NaN  23.0        NaN     NaN
         2.0        NaN        NaN        NaN  25.0  26.500000     NaN
         2.5        NaN        NaN  22.000000  24.2  23.333333     NaN
         3.0        NaN        NaN  26.000000  25.0  28.500000     NaN
         3.5        NaN        NaN        NaN  30.0        NaN     NaN


rep78                      2.0          3.0     4.0          5.0
foreig   headroom
Domestic 1.5               NaN          NaN  1800.0          NaN
         2.0       2886.666667  3142.000000     NaN  2120.000000
         2.5               NaN  3253.333333     NaN  1800.000000
         3.0               NaN  3670.000000  3355.0          NaN
         3.5       3900.000000  3634.000000  4060.0          NaN
         4.0       3600.000000  3400.000000  3844.0          NaN
         4.5       3740.000000  3306.666667     NaN          NaN
         5.0       3330.000000          NaN     NaN          NaN
Foreign  1.5               NaN          NaN  2370.0          NaN
         2.0               NaN          NaN  1990.0  2345.000000
         2.5               NaN  2100.000000  2320.0  2543.333333
         3.0               NaN  1830.000000  1930.0  2327.500000
         3.5               NaN          NaN  1980.0          NaN

In [99]:
#rep78 ya no es más índice de filas:
df8.index

MultiIndex([('Domestic', 1.5),
            ('Domestic', 2.0),
            ('Domestic', 2.5),
            ('Domestic', 3.0),
            ('Domestic', 3.5),
            ('Domestic', 4.0),
            ('Domestic', 4.5),
            ('Domestic', 5.0),
            ( 'Foreign', 1.5),
            ( 'Foreign', 2.0),
            ( 'Foreign', 2.5),
            ( 'Foreign', 3.0),
            ( 'Foreign', 3.5)],
           names=['foreig', 'headroom'])

In [100]:
#y pasa a indexar las columnas.
df8.columns

MultiIndex([( 'price', 1.0),
            ( 'price', 2.0),
            ( 'price', 3.0),
            ( 'price', 4.0),
            ( 'price', 5.0),
            (   'mpg', 1.0),
            (   'mpg', 2.0),
            (   'mpg', 3.0),
            (   'mpg', 4.0),
            (   'mpg', 5.0),
            ('weight', 1.0),
            ('weight', 2.0),
            ('weight', 3.0),
            ('weight', 4.0),
            ('weight', 5.0)],
           names=[None, 'rep78'])

In [101]:
#Esta vez probamos quitando foreig como índice de filas
df9 = df4.groupby(["foreig","rep78"])[["price","mpg","weight"]].mean()
df9

                      price        mpg       weight
foreig   rep78
Domestic 1.0    4564.500000  21.000000  3100.000000
         2.0    5967.625000  19.125000  3353.750000
         3.0    6607.074074  19.000000  3442.222222
         4.0    5881.555556  18.444444  3532.222222
         5.0    4204.500000  32.000000  1960.000000
Foreign  3.0    4828.666667  23.333333  2010.000000
         4.0    6261.444444  24.888889  2207.777778
         5.0    6292.666667  26.333333  2403.333333

In [102]:
df9 = df9.unstack(0)
df9

              price                     mpg                  weight  \
foreig     Domestic      Foreign   Domestic    Foreign     Domestic
rep78
1.0     4564.500000          NaN  21.000000        NaN  3100.000000
2.0     5967.625000          NaN  19.125000        NaN  3353.750000
3.0     6607.074074  4828.666667  19.000000  23.333333  3442.222222
4.0     5881.555556  6261.444444  18.444444  24.888889  3532.222222
5.0     4204.500000  6292.666667  32.000000  26.333333  1960.000000


foreig      Foreign
rep78
1.0             NaN
2.0             NaN
3.0     2010.000000
4.0     2207.777778
5.0     2403.333333

In [103]:
#Foreig ya no indexa la filas
df9.index

Float64Index([1.0, 2.0, 3.0, 4.0, 5.0], dtype='float64', name='rep78')

In [104]:
#y pasa a indexar columnas
df9.columns

MultiIndex([( 'price', 'Domestic'),
            ( 'price',  'Foreign'),
            (   'mpg', 'Domestic'),
            (   'mpg',  'Foreign'),
            ('weight', 'Domestic'),
            ('weight',  'Foreign')],
           names=[None, 'foreig'])

Este es el esquema de la operación que realiza unstack (0):
<div> <img src="files/reshaping_unstack_0.png" width="500"/> </div>

**Análisis cruzado de variables (crosstab):**

Con crosstab podemos cruzar nuestras variables ya sea de forma simple, utilizando funciones de agregado o para calcular porcentajes.

In [105]:
#Cantidad de reparaciones en 1978 según origen.
df10= pd.crosstab(df4.foreig,df4.rep78)
df10

rep78     1.0  2.0  3.0  4.0  5.0
foreig
Domestic    2    8   27    9    2
Foreign     0    0    3    9    9

In [106]:
#Cantidad de reparaciones con totales y nombres según origen
df11= pd.crosstab(df4.foreig,df4.rep78,
                  colnames= ["Candidad de reparaciones"],
                  rownames= ["Origen"],
                  margins= True,
                  margins_name="Total"
                  
)
df11

Candidad de reparaciones  1.0  2.0  3.0  4.0  5.0  Total
Origen
Domestic                    2    8   27    9    2     48
Foreign                     0    0    3    9    9     21
Total                       2    8   30   18   11     69

In [107]:
#Cantidad de reparaciones expresadas al tanto por uno, según origen, con totales y nombres
df11= pd.crosstab(df4.foreig,df4.rep78,
                  colnames= ["Candidad de reparaciones"],
                  rownames= ["Origen"],
                  margins= True,
                  margins_name="Total",
                  normalize=True
                  
)
df11

Candidad de reparaciones,1.0,2.0,3.0,4.0,5.0,Total
Origen,,,,,,
Domestic,0.028986,0.115942,0.391304,0.130435,0.028986,0.695652
Foreign,0.000000,0.000000,0.043478,0.130435,0.130435,0.304348
Total,0.028986,0.115942,0.434783,0.260870,0.159420,1.000000

In [108]:
#Cantidad de reparaciones expresadas en porcentaje, según origen, con totales y nombres
df11= pd.crosstab(df4.foreig,df4.rep78,
                  colnames= ["Candidad de reparaciones"],
                  rownames= ["Origen"],
                  margins= True,
                  margins_name="Total",
                  normalize=True
                  
).apply(lambda r: round(r*100,2))
df11

Candidad de reparaciones  1.0    2.0    3.0    4.0    5.0   Total
Origen
Domestic                  2.9  11.59  39.13  13.04   2.90   69.57
Foreign                   0.0   0.00   4.35  13.04  13.04   30.43
Total                     2.9  11.59  43.48  26.09  15.94  100.00

In [109]:
#Precio promedio según origen y cantidad de reparaciones
df12 = pd.crosstab(
        index=df4["foreig"],
        columns=df4["rep78"],
        values=df4["price"],
        colnames= ["Candidad de reparaciones"], 
        rownames= ["Origen"],
        aggfunc="mean"   
)
df12

Candidad de reparaciones,1.0,2.0,3.0,4.0,5.0
Origen,,,,,
Domestic,4564.5,5967.625,6607.074074,5881.555556,4204.500000
Foreign,NaN,NaN,4828.666667,6261.444444,6292.666667

Esquema de funcionamiento de crosstab:

<div> <img src="files/crosstab_cheatsheet.png" width="1000"/> </div>

### Combinar tablas

#### Pandas merge / SQL Join (PL/PgSQL)

Merge o Join (SQL) nos permite combinar registros de varias tablas en una sola. En Pandas hay 4 tipos de join (merge):

* Inner
* Left
* Right
* Outer

**Sintaxis:**
* pd.merge(df1, df2, on=["key_1","key_2","key_n"], how= ("inner"/"left"/"right"/"outer")

* df1.merge(df2, how=("inner"/"left"/"right"/"outer"), on=["key_1","key_2,key_n"])

on = columnas o columas que las tablas tienen en común.
how = tipo de join. Si no se especifica por default es un inner.


Para explicar cada join vamos a trabajar con dos tablas que contienen datos de bebidas gaseosas, la primera de ellas contiene su aporte energético (kcal) y la segunda detalla sus macronutrientes (macro).

In [110]:
kcal= {"Marca":["Coca", "Coca Zero", "Pepsi", "Manaos"],
       "Kcal":[37, 0.1, 31, 45]
    }

kcal= pd.DataFrame(kcal).sort_values(by="Marca").reset_index(drop=True)
kcal

       Marca  Kcal
0       Coca  37.0
1  Coca Zero   0.1
2     Manaos  45.0
3      Pepsi  31.0

In [111]:
macro= {"Marca":["Coca", "Pepsi", "Cunnington", "Manaos", "Sprite"],
        "Azucares":[9, 7.5, 10, 11,10],
        "Proteinas": [0.1, 0, 0.2, 0.1,0],
        "Grasas": [0, 0, 0, 0,0] 
    }

macro= pd.DataFrame(macro).sort_values(by="Marca").reset_index(drop=True)
macro

        Marca  Azucares  Proteinas  Grasas
0        Coca       9.0        0.1       0
1  Cunnington      10.0        0.2       0
2      Manaos      11.0        0.1       0
3       Pepsi       7.5        0.0       0
4      Sprite      10.0        0.0       0

##### Inner join

Esta cláusula busca coincidencias entre 2 tablas, en función a una columna que tienen en común. De tal modo que sólo la intersección se mostrará en los resultados.

![](files/INNER_JOIN.webp)

![](files/join-inner_2.png)

In [112]:
gaseosas_inner = pd.merge(kcal, macro, on="Marca", how="inner")
gaseosas_inner

    Marca  Kcal  Azucares  Proteinas  Grasas
0    Coca  37.0       9.0        0.1       0
1  Manaos  45.0      11.0        0.1       0
2   Pepsi  31.0       7.5        0.0       0

In [113]:
#Con el parámetro indicator podemos saber de qué tabla/s proviene nuestra fila
gaseosas_inner = pd.merge(kcal, macro, on="Marca", how="inner",indicator=True)
gaseosas_inner

    Marca  Kcal  Azucares  Proteinas  Grasas _merge
0    Coca  37.0       9.0        0.1       0   both
1  Manaos  45.0      11.0        0.1       0   both
2   Pepsi  31.0       7.5        0.0       0   both

SQL:

SELECT
	m.marca AS marca,
	k.kcal,
	m.azucares,
	m.proteinas,
	m.grasas
FROM bebidas.kcals AS k
INNER JOIN bebidas.macronutrientes AS m
	ON k.marca = m.marca
ORDER BY
	k.marca ASC

![](files/inner_sql.png)

##### Left join
A diferencia de un INNER JOIN, donde se busca una intersección entre ambas tablas, con LEFT JOIN damos prioridad a la tabla de la izquierda, y buscamos en la tabla derecha. Si no existiese ninguna coincidencia se mostrarán todos los resultados de la primera tabla.

![](files/LEFT_JOIN.webp)

![](files/left_joint.png)

In [114]:
gaseosas_left = pd.merge(kcal, macro, on="Marca", how="left")
gaseosas_left

       Marca  Kcal  Azucares  Proteinas  Grasas
0       Coca  37.0       9.0        0.1     0.0
1  Coca Zero   0.1       NaN        NaN     NaN
2     Manaos  45.0      11.0        0.1     0.0
3      Pepsi  31.0       7.5        0.0     0.0

In [115]:
gaseosas_left = pd.merge(kcal, macro, on="Marca", how="left", indicator=True)
gaseosas_left

       Marca  Kcal  Azucares  Proteinas  Grasas     _merge
0       Coca  37.0       9.0        0.1     0.0       both
1  Coca Zero   0.1       NaN        NaN     NaN  left_only
2     Manaos  45.0      11.0        0.1     0.0       both
3      Pepsi  31.0       7.5        0.0     0.0       both

SQL:

--Left join
SELECT
	m.marca,
	k.kcal,
	m.azucares,
	m.proteinas,
	m.grasas
FROM bebidas.kcals AS k
LEFT JOIN bebidas.macronutrientes AS m
	ON k.marca = m.marca

![](files/left_sql_1.png)

Observemos que el output de SQL es distinto al de Pandas. Donde debiera decir "Coca Zero" tenemos un valor null, esto sucede porque en SQL debemos indicar de qué tabla queremos cada columna. Nosotros solicitamos de la tabla macronutrientes la columna marca pero "Coca Zero" no existe en macronutrientes (tabla derecha), existe en calorías (tabla izquierda), por eso no la encuentra.

Solicitemos la columna marca de ambas tablas para que sea más claro (SELECT k.kcal, m.marca, m.azucares...)

![](files/left_sql_2.png)

Entonces, para que nuestra consulta tenga el output correcto, debemos solicitar marca de la tabla de calorías.

SQL:

--Left join
SELECT
	k.marca,
	k.kcal,
	m.azucares,
	m.proteinas,
	m.grasas
FROM bebidas.kcals AS k
LEFT JOIN bebidas.macronutrientes AS m
	ON k.marca = m.marca

![](files/left_sql_3.png)

##### Right join

En el caso de RIGHT JOIN la situación es muy similar, pero aquí se da prioridad a la tabla de la derecha y buscará en la tabla izquierda las coincidencias.

![](files/RIGHT_JOIN.webp)

![](files/right_join.png)

In [116]:
gaseosas_right = pd.merge(kcal, macro, on="Marca", how="right")
gaseosas_right

        Marca  Kcal  Azucares  Proteinas  Grasas
0        Coca  37.0       9.0        0.1       0
1  Cunnington   NaN      10.0        0.2       0
2      Manaos  45.0      11.0        0.1       0
3       Pepsi  31.0       7.5        0.0       0
4      Sprite   NaN      10.0        0.0       0

In [117]:
gaseosas_right = pd.merge(kcal, macro, on="Marca", how="right", indicator=True)
gaseosas_right

        Marca  Kcal  Azucares  Proteinas  Grasas      _merge
0        Coca  37.0       9.0        0.1       0        both
1  Cunnington   NaN      10.0        0.2       0  right_only
2      Manaos  45.0      11.0        0.1       0        both
3       Pepsi  31.0       7.5        0.0       0        both
4      Sprite   NaN      10.0        0.0       0  right_only

SQL:

--Right join
SELECT
	m.marca,
	k.kcal,
	m.azucares,
	m.proteinas,
	m.grasas
FROM bebidas.kcals AS k
RIGHT JOIN bebidas.macronutrientes AS m
	ON k.marca = m.marca
ORDER BY
	m.marca ASC

Recordemos seleccionar la tabla correcta:

![](files/right_sql.png)

##### Outer join

Mientras que LEFT JOIN muestra todas las filas de la tabla izquierda, y RIGHT JOIN muestra todas las correspondientes a la tabla derecha, OUTER JOIN (o sus sinónimos FULL JOIN o FULL OUTER JOIN) se encarga de mostrar todas las filas de ambas tablas, sin importar que no existan coincidencias. En los casos en que no haya coincidencia mostrará NaN/null por defecto.

![](files/OUTER_JOIN.webp)

![](files/outer_joint.png)

In [118]:
gaseosas_outer = pd.merge(kcal, macro, on="Marca", how="outer")
gaseosas_outer

        Marca  Kcal  Azucares  Proteinas  Grasas
0        Coca  37.0       9.0        0.1     0.0
1   Coca Zero   0.1       NaN        NaN     NaN
2      Manaos  45.0      11.0        0.1     0.0
3       Pepsi  31.0       7.5        0.0     0.0
4  Cunnington   NaN      10.0        0.2     0.0
5      Sprite   NaN      10.0        0.0     0.0

In [119]:
gaseosas_outer = pd.merge(kcal, macro, on="Marca", how="outer", indicator=True)
gaseosas_outer

        Marca  Kcal  Azucares  Proteinas  Grasas      _merge
0        Coca  37.0       9.0        0.1     0.0        both
1   Coca Zero   0.1       NaN        NaN     NaN   left_only
2      Manaos  45.0      11.0        0.1     0.0        both
3       Pepsi  31.0       7.5        0.0     0.0        both
4  Cunnington   NaN      10.0        0.2     0.0  right_only
5      Sprite   NaN      10.0        0.0     0.0  right_only

Pero en SQL no es tan fácil, revisemos la columna marca de cada tabla...

SQL:

--Full Outer Join
SELECT
	k.marca AS marca_kcal,
	m.marca AS marca_macronutrientes,
	k.kcal,
	m.azucares,
	m.proteinas,
	m.grasas
FROM bebidas.kcals AS k
FULL OUTER JOIN bebidas.macronutrientes AS m
	ON k.marca = m.marca
ORDER BY
	k.marca ASC

Acá podemos ver que no hay una sola columna correcta de marca para elegir. Coca Zero no existe en la tabla de macronutrientes, Cunnington y Sprite no existen en la tabla de calorías. Pandas esto lo resolvía por nosotros pero en SQL debemos dar una vuelta más...

![](files/outer_sql_1.png)

Entonces, vamos a usar la función COALESCE, la cual es propia de PL/PgSQL. Cada implementación de SQL puede tener una función equivalente o de similar funcionamiento.

Veamos la sintaxis de COALESCE:

COALESCE(tablaA.columna_n,tablaB.columna_n) AS nombre_de_columna.

COALESCE va a preguntarse si un registro es nulo en la columna_n de la tabla y si es nulo va a utilizar la columna_n de la tablaB.

En nuestro ejemplo funciona de esta manera:

*COALESCE: ¿Es nula la columna marca en la marca de la tabla macronutrientes?*
   * **No:** Todo OK, usa el registro de la tabla macronutrientes.
   * **Sí:** Va a buscar el registro en la tabla kcal y lo completa en nuestro output.
   
En el caso del left y right join podríamos habernos ahorrado de pensar cuál es la tabla correcta y directamente haber usado COALESCE, pero sabiendo la teoría y conociendo nuestros datos, podemos evitarle al servidor computar innecesariamente una función.

SQL:

--Full Outer Join
SELECT
	COALESCE(m.marca,k.marca) AS marca,
	k.kcal,
	m.azucares,
	m.proteinas,
	m.grasas
FROM bebidas.kcals AS k
FULL OUTER JOIN bebidas.macronutrientes AS m
	ON k.marca = m.marca
ORDER BY
	marca ASC

![](files/outer_sql_2.png)

###### Uso de joins en el mundo de la vida


<div> <img src="files/1632174980836.jpg" width="400"/> </div>

##### Cross join

El cross join es un tipo de join que nos devuelve el producto cartesiano entre las tablas (todas las combinaciones posibles). No lo hemos incluído en la lista anterior porque originalmente no era un tipo de join admitido por Pandas, por lo que debíamos programarlo a mano alzada. Lo bueno es que es muy fácil de hacer.

![](files/cross_join.png)

Para generar un cross join vamos a crear dos dataframes, uno de platos y otras guarniciones.

In [120]:
platos= {'Plato': ["Milanesa","Suprema de pollo","Milanesa de soja"]}
platos= pd.DataFrame(platos).reset_index(drop=True)
platos

              Plato
0          Milanesa
1  Suprema de pollo
2  Milanesa de soja

In [121]:
guarniciones= {"Guarnicion":["Puré de papa","Puré de calabaza",
                             "Ensalada mixta", "Ensalada completa",
                             "Papas fritas"]}

guarniciones= pd.DataFrame(guarniciones).reset_index(drop=True)
guarniciones

          Guarnicion
0       Puré de papa
1   Puré de calabaza
2     Ensalada mixta
3  Ensalada completa
4       Papas fritas

Después lo que vamos a hacer es crear en cada dataframe una columna que asuma un único valor, 1 en nuestro caso. Esta columna es fundamental porque haremos nuestro join a partir de ella.

In [122]:
platos["key"] = 1
platos

              Plato  key
0          Milanesa    1
1  Suprema de pollo    1
2  Milanesa de soja    1

In [123]:
guarniciones["key"] = 1
guarniciones

          Guarnicion  key
0       Puré de papa    1
1   Puré de calabaza    1
2     Ensalada mixta    1
3  Ensalada completa    1
4       Papas fritas    1

La columna key al asumir el mismo valor en cada tabla nos permitirá hacer el join con todas las combinaciones posibles.

In [124]:
plato_guarnicion = pd.merge(platos, guarniciones, on ="key").drop(columns="key")
plato_guarnicion

               Plato         Guarnicion
0           Milanesa       Puré de papa
1           Milanesa   Puré de calabaza
2           Milanesa     Ensalada mixta
3           Milanesa  Ensalada completa
4           Milanesa       Papas fritas
5   Suprema de pollo       Puré de papa
6   Suprema de pollo   Puré de calabaza
7   Suprema de pollo     Ensalada mixta
8   Suprema de pollo  Ensalada completa
9   Suprema de pollo       Papas fritas
10  Milanesa de soja       Puré de papa
11  Milanesa de soja   Puré de calabaza
12  Milanesa de soja     Ensalada mixta
13  Milanesa de soja  Ensalada completa
14  Milanesa de soja       Papas fritas

SQL:

    SELECT
	plato,
	g.guarnicion
FROM platos
     CROSS JOIN guarniciones AS g

![](files/cross_join_Sql.png)

Algunas aclaraciones finales sobre Pandas merge:

No es necesario que las columnas que serán nuestra key tengan el mismo nombre en ambas tablas, podemos utilizar los parámetros left_on y right_on.

Tampoco, es necesario combinar todas las columnas de ambas tablas, por ejemplo:

In [125]:
gaseosas_inner_2 = pd.merge(kcal, macro[["Marca","Azucares"]], on="Marca", how="inner")
gaseosas_inner_2

    Marca  Kcal  Azucares
0    Coca  37.0       9.0
1  Manaos  45.0      11.0
2   Pepsi  31.0       7.5

Merge no es el único método para hacer joins similares a SQL, con el método join podemos obtener los mismos resultados. Nosotros nos hemos concentramos en merge porque es más versátil y tiene una sintaxis un poco más legible que join pero ambos métodos son bienvenidos y quedan invitados a investigar sus diferencias y revisar su documentación.

* https://www.geeksforgeeks.org/what-is-the-difference-between-join-and-merge-in-pandas/

* https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

* https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html#pandas.DataFrame.join

#### Pandas concat / SQL Union ALL y UNION (PL/PgSQL)¶

Pandas, UNION ALL y UNION (SQL) nos permiten apilar nuestras tablas/consultas.

**Sintaxis:**

    pd.concat([tabla_a, tabla_b, tabla_c], ignore_index=True)

El parámetro ignore_index nos permite crear un nuevo índice para nuestra tabla apilada de modo que no herede los índices de las tablas originales.

Vamos a crear tres dataframes para ponerlo a prueba:

In [126]:
finanzas = {"Nombre": ["Juan Pérez", "María Gómez","Juan Pérez"], "Area": ["Finanzas", "Finanzas","Finanzas"]}
finanzas = pd.DataFrame.from_dict(finanzas)
finanzas

        Nombre      Area
0   Juan Pérez  Finanzas
1  María Gómez  Finanzas
2   Juan Pérez  Finanzas

In [127]:
rrhh = {"Nombre": ["Ana Estévez", "Diego Hernández","Marcela Pérez García"], "Area": ["RRHH", "RRHH","RRHH"]}
rrhh = pd.DataFrame.from_dict(rrhh)
rrhh

                 Nombre  Area
0           Ana Estévez  RRHH
1       Diego Hernández  RRHH
2  Marcela Pérez García  RRHH

In [128]:
ventas= {"Nombre": ["Matías Rodríguez", "Silvia García"], "Area": ["Ventas", "Ventas"],"Antiguedad_Anios": [3, 6.9]}
ventas= pd.DataFrame.from_dict(ventas)
ventas

             Nombre    Area  Antiguedad_Anios
0  Matías Rodríguez  Ventas               3.0
1     Silvia García  Ventas               6.9

##### UNION ALL

En SQL podemos distinguir UNION ALL de UNION, el primero ignora los duplicados, el segundo los elimina.

Cabe destacar que nuestro ejemplo es trivial, las tablas de SQL no deberían contener registros duplicados porque ello supondría una violación a la integridad referencial.

In [129]:
empleados_union_all = pd.concat([finanzas, rrhh, ventas],ignore_index=True)
empleados_union_all

                 Nombre      Area  Antiguedad_Anios
0            Juan Pérez  Finanzas               NaN
1           María Gómez  Finanzas               NaN
2            Juan Pérez  Finanzas               NaN
3           Ana Estévez      RRHH               NaN
4       Diego Hernández      RRHH               NaN
5  Marcela Pérez García      RRHH               NaN
6      Matías Rodríguez    Ventas               3.0
7         Silvia García    Ventas               6.9

SQL:

SELECT 
	nombre,
	area, 
	null::double precision AS antiguedad_anios 
    --Especificamos double precision porque en la tabla en que no tiene valores null (ventas) es de ese tipo
FROM finanzas
UNION ALL
SELECT 
	nombre,
	area,
	null::double precision AS antiguedad_anios FROM rrhh
UNION ALL
SELECT nombre,
	area,
	antiguedad_anios AS antiguedad_anios FROM ventas;

![](files/union_all.png)

##### UNION

In [130]:
empleados_union = pd.concat([finanzas, rrhh, ventas]).drop_duplicates().reset_index(drop=True)
empleados_union

                 Nombre      Area  Antiguedad_Anios
0            Juan Pérez  Finanzas               NaN
1           María Gómez  Finanzas               NaN
2           Ana Estévez      RRHH               NaN
3       Diego Hernández      RRHH               NaN
4  Marcela Pérez García      RRHH               NaN
5      Matías Rodríguez    Ventas               3.0
6         Silvia García    Ventas               6.9

SQL:

SELECT 
	nombre,
	area, 
	null::double precision AS antiguedad_anios 
FROM finanzas
UNION
SELECT 
	nombre,
	area,
	null::double precision AS antiguedad_anios FROM rrhh
UNION
SELECT nombre,
	area,
	antiguedad_anios AS antiguedad_anios FROM ventas
ORDER BY
	area ASC,
	nombre ASC,
	antiguedad_anios ASC

![](files/union.png)

### Tipos de relaciones

##### Uno a uno: 
En este tipo de relación, cuando en una tabla con registros únicos se asocian a un único registro de otra tabla.

In [131]:
promedios= {
    "ALUMNO": ["Juan", "Ana", "María"],
    "PROMEDIO_CARRERA": [7.75, 6.82, 8.45]
}
promedios = pd.DataFrame.from_dict(promedios)
promedios

  ALUMNO  PROMEDIO_CARRERA
0   Juan              7.75
1    Ana              6.82
2  María              8.45

In [132]:
edades= {
    "ALUMNO": ["Juan", "Ana", "María"],
    "EDAD_AL_RECIBIRSE": [26, 24, 31]
}
edades = pd.DataFrame.from_dict(edades)
edades

  ALUMNO  EDAD_AL_RECIBIRSE
0   Juan                 26
1    Ana                 24
2  María                 31

In [133]:
pd.merge(promedios, edades, on="ALUMNO", how="inner")

  ALUMNO  PROMEDIO_CARRERA  EDAD_AL_RECIBIRSE
0   Juan              7.75                 26
1    Ana              6.82                 24
2  María              8.45                 31

##### Uno a muchos (o muchos a uno)
Estamos ante este tipo de relación cuando un registro de una tabla con registros únicos se asocia a más de un registro de otra tabla.

In [134]:
domicilios= {
    "CLIENTE": ["Héctor", "Estela", "Karina", "Esteban"],
    "DOMICILIO": ["Mitre 1201","Sarmiento 2804","Avellaneda 2127","Roca 3412"]}
domicilios= pd.DataFrame.from_dict(domicilios)
domicilios

   CLIENTE        DOMICILIO
0   Héctor       Mitre 1201
1   Estela   Sarmiento 2804
2   Karina  Avellaneda 2127
3  Esteban        Roca 3412

In [135]:
pedidos= {
    "CLIENTE": ["Héctor", "Estela", "Karina","Esteban","Esteban"],
    "PEDIDO": [1, 1, 1, 1,2],
    "MONTO": [12000,8400,13340,9127,14315]
}
pedidos= pd.DataFrame.from_dict(pedidos)
pedidos

   CLIENTE  PEDIDO  MONTO
0   Héctor       1  12000
1   Estela       1   8400
2   Karina       1  13340
3  Esteban       1   9127
4  Esteban       2  14315

In [136]:
pd.merge(pedidos,domicilios, on="CLIENTE", how="inner")

   CLIENTE  PEDIDO  MONTO        DOMICILIO
0   Héctor       1  12000       Mitre 1201
1   Estela       1   8400   Sarmiento 2804
2   Karina       1  13340  Avellaneda 2127
3  Esteban       1   9127        Roca 3412
4  Esteban       2  14315        Roca 3412

Esquema:

![](files/join-one-to-many_5.png)

![](notas_files/join-one-to-many_5.png)

##### Muchos a muchos
Tiene lugar este tipo de relación cuando varios registros de una tabla pueden asociarse a varios registros de otra tabla.

In [137]:
ventas= {
        "PROVINCIA": ["San Luis","Santa Fe", "Santa Fe", "Mendoza"],
        "CANAL_VENTA": ["Local", "Web", "Local", "Local"],
        "MONTO_VENTAS": [3200000,4003000,5700000,6420000]
}

ventas= pd.DataFrame.from_dict(ventas)
ventas

  PROVINCIA CANAL_VENTA  MONTO_VENTAS
0  San Luis       Local       3200000
1  Santa Fe         Web       4003000
2  Santa Fe       Local       5700000
3   Mendoza       Local       6420000

In [138]:
prov= {
    "PROVINCIA": ["San Luis","Santa Fe", "Santa Fe", "Mendoza"],
    "DEPARTAMENTO": ["Juan Martín de Pueyrredón","Rosario", "La Capital", "Guaymallén"],
    "HABITANTES_2010": [204512,1193605,525093,283803]
}
prov= pd.DataFrame.from_dict(prov)
prov

  PROVINCIA               DEPARTAMENTO  HABITANTES_2010
0  San Luis  Juan Martín de Pueyrredón           204512
1  Santa Fe                    Rosario          1193605
2  Santa Fe                 La Capital           525093
3   Mendoza                 Guaymallén           283803

In [139]:
ventas_prov= pd.merge(ventas, prov, on="PROVINCIA", how="left")    
ventas_prov

,PROVINCIA,CANAL_VENTA,MONTO_VENTAS,DEPARTAMENTO,HABITANTES_2010
0,San Luis,Local,3200000,Juan Martín de Pueyrredón,204512
1,Santa Fe,Web,4003000,Rosario,1193605
2,Santa Fe,Web,4003000,La Capital,525093
3,Santa Fe,Local,5700000,Rosario,1193605
4,Santa Fe,Local,5700000,La Capital,525093
5,Mendoza,Local,6420000,Guaymallén,283803

Esquema:
    
![](files/join-many-to-many_6.png)

Cuando estamos ante este tipo de relación tenemos que ser muy cuidadosos porque si de esta tabla quisiéramos obtener las ventas o los habitantes por provincia, en Santa Fe estaríamos duplicando resultados.

In [140]:
ventas_prov.groupby(["PROVINCIA"])[["HABITANTES_2010"]].sum()

           HABITANTES_2010
PROVINCIA
Mendoza             283803
San Luis            204512
Santa Fe           3437396

Resolvamos esto...

In [141]:
(ventas_prov
    .drop_duplicates(subset=["PROVINCIA","HABITANTES_2010"]) #Eliminamos duplicados en términos de provincia y habitantes
    .groupby(["PROVINCIA"])[["HABITANTES_2010"]].sum() #Agrupamos
)

           HABITANTES_2010
PROVINCIA
Mendoza             283803
San Luis            204512
Santa Fe           1718698

Merge nos permite validar la relación entre las tablas a combinar con el parámetro validate. Debemos declararle el tipo de relación que pensamos que hay entre nuestras tablas, si este tipo es incorrecto nos devolverá un error.

Usemos las tablas que ya sabemos que de antemano que se relacionan de muchos a muchos y validemos si las relación es de uno a muchos.

In [142]:
from pandas.errors import MergeError

try:
    pd.merge(ventas, prov, on="PROVINCIA", how="left",validate="1:m")
except MergeError as err:
    print(err)

Merge keys are not unique in left dataset; not a one-to-many merge

Para más información de este parámetro consultar la documentación:
* https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

### Funciones anónimas (lambda)

Pandas nos permite utilizar funciones anónimas junto a funciones de agrupación, vamos poner esto a prueba creando un dataframe de resultados electorales.

Vamos a calcular:

* Porcentaje de votos por distrito.
* Porcentaje de votos sobre el total.

In [143]:
resultados= {
        "distrito": [1,2,1,2,1,2,1,2],
        "candidato": ["A","A","B","B","C","C","D","D"],
        "votos": [np.nan,3432,1234,6789,2346,9654,3121,5210]
        }

resultados= pd.DataFrame.from_dict(resultados).sort_values("distrito").reset_index(drop=True)
resultados

   distrito candidato   votos
0         1         A     NaN
1         1         B  1234.0
2         1         C  2346.0
3         1         D  3121.0
4         2         A  3432.0
5         2         B  6789.0
6         2         C  9654.0
7         2         D  5210.0

* Porcentaje de votos por distrito:

En primer lugar lo que vamos a hacer es establecer como índice a las columnas distrito y candidato, más adelante veremos la razón de esto, por ahora será una cuestión de fe.

In [144]:
votos_agrup_distrito= resultados.set_index(["distrito","candidato"])
votos_agrup_distrito

                     votos
distrito candidato
1        A             NaN
         B          1234.0
         C          2346.0
         D          3121.0
2        A          3432.0
         B          6789.0
         C          9654.0
         D          5210.0

Una vez que hicimos esto observemos la siguiente línea en el bloque de código siguiente. 

El método apply se utiliza en Pandas para aplicar una función anónima, por default se ejecuta sobre las columnas (axis=0).

**.apply(lambda x: x / float(x.sum())*100)**

Entonces la operación que realizará apply será la siguiente

* lambda columna_1: columna_1 / float(columna_1.sum())*100)

* lambda columna_2: columna_1 / float(columna_2.sum())*100)

* lambda columna_n: columna_1 / float(columna_n.sum())*100)

Ahora que sabemos cómo funciona apply revisemos nuestra función...

Cada fila de la columna será dividida por el total de la columna (respetando el group by) que hayamos definido, es decir...

* columna_1_fila_1 / suma(columna_1_según_group_by)
* columna_1_fila_2 / suma(columna_1_según_group_by)
* columna_1_fila_3 / suma(columna_1_según_group_by)

y así sucesivamente...

Después, a cada resultado lo va a multiplicar por 100 para obtener el porcentaje.

También podemos observar que usamos la función float, esto lo hacemos porque la suma de los votos nos podría devolver una columna de tipo int, nosotros forzamos que sea float para poder expresar el resultado en números decimales. En nuestro caso al tener una fila con valor NaN, nuestra columna no será una columna int, pero decidimos mantener el uso de esta función, asumiendo que en un caso real podríamos no haber inspeccionado a priori el dataframe.

In [145]:
pct_candidato_distrito= (
    votos_agrup_distrito.groupby(["distrito"])
        .apply(lambda x: x / float(x.sum())*100)   #<-----------
        .round(4)
        .sort_values("distrito")
        .reset_index()
        .merge(resultados,on=["candidato","distrito"], how="inner")   
        .rename(columns = {"votos_x":"pct_votos","votos_y":"votos"})
        .reindex(columns=["distrito","candidato","votos","pct_votos"])
)

pct_candidato_distrito

   distrito candidato   votos  pct_votos
0         1         A     NaN        NaN
1         1         B  1234.0    18.4152
2         1         C  2346.0    35.0097
3         1         D  3121.0    46.5751
4         2         A  3432.0    13.6815
5         2         B  6789.0    27.0640
6         2         C  9654.0    38.4852
7         2         D  5210.0    20.7694

Ya sabemos como funciona apply y las funciones lambda, nos queda pendiente entender el set_index que hicimos al principio. Creamos una función que calcula un porcentaje y gracias a apply nuestra función se aplicará en cada columna. Pero... si no estamos atentos vamos a recibir un mensaje de error porque candidato es string, por eso lo que hacemos es elevarla a índice junto a distrito, de esta manera apply no "pasará" por el nombre del candidato y nuestra función correrá sin problemas.

Ahora estamos en condiciones de resolver esto en un solo bloque de código...

In [146]:
pct_candidato_distrito= (
    resultados
        .set_index(["distrito","candidato"]) #<----------- Agregamos este paso
        .groupby(["distrito"])
        .apply(lambda x: x / float(x.sum())*100) 
        .round(4)
        .sort_values("distrito")
        .reset_index()
        .merge(resultados,on=["candidato","distrito"], how="inner")   
        .rename(columns = {"votos_x":"pct_votos","votos_y":"votos"})
        .reindex(columns=["distrito","candidato","votos","pct_votos"])
        .fillna({"pct_votos":0})       
)

pct_candidato_distrito

   distrito candidato   votos  pct_votos
0         1         A     NaN     0.0000
1         1         B  1234.0    18.4152
2         1         C  2346.0    35.0097
3         1         D  3121.0    46.5751
4         2         A  3432.0    13.6815
5         2         B  6789.0    27.0640
6         2         C  9654.0    38.4852
7         2         D  5210.0    20.7694

SQL:

SELECT
	resultados.distrito,
	candidato,
	resultados.votos AS votos,
	COALESCE(ROUND((resultados.votos/votos_distrito.votos::numeric)*100,4),0) AS pct_votos
FROM
	resultados
INNER JOIN
	(SELECT
		distrito,
		SUM(votos) AS votos
	FROM
		resultados
	GROUP BY
		distrito
	ORDER BY
		distrito ASC) AS votos_distrito
ON resultados.distrito = votos_distrito.distrito
ORDER BY
	distrito ASC,
	candidato ASC

![](files/votos_dist_sql.png)

* Porcentaje de votos sobre el total

Como empezamos por el caso más difícil este caso nos va resultar muy sencillo, primero empezamos calculando el total de votos por candidato. Recordemos que groupby convierte en índice a las columnas de agrupación así que no tendremos que usar set_index antes de calcular el porcentaje.

In [147]:
votos_agrup_candidato= (
                        resultados.groupby(["candidato"])
                            .agg({'votos': 'sum'})
)

votos_agrup_candidato

             votos
candidato
A           3432.0
B           8023.0
C          12000.0
D           8331.0

In [148]:
pct_candidato= (
                votos_agrup_candidato
                .apply(lambda x: x / float(x.sum())*100) 
                .round(4)
                .reset_index()
                .sort_values("candidato")
                .reset_index(drop=True)
                .merge(votos_agrup_candidato[["votos"]],on="candidato", how="inner")   
                .rename(columns = {"votos_x":"pct_votos","votos_y":"votos"})
                .reindex(columns=["candidato","votos","pct_votos"])
                .astype({'votos': 'int32'})
)

pct_candidato

  candidato  votos  pct_votos
0         A   3432    10.7972
1         B   8023    25.2407
2         C  12000    37.7525
3         D   8331    26.2097

Y ahora lo hacemos en un solo paso...

In [149]:
pct_candidato= (
                resultados
                .groupby(["candidato"])
                    .agg({'votos': 'sum'})
                .apply(lambda x: x / float(x.sum())*100) 
                .round(4)
                .reset_index()
                .sort_values("candidato")
                .reset_index(drop=True)
                .merge(votos_agrup_candidato[["votos"]],on="candidato", how="inner")   
                .rename(columns = {"votos_x":"pct_votos","votos_y":"votos"})
                .reindex(columns=["candidato","votos","pct_votos"])
                .astype({'votos': 'int32'})
)

pct_candidato

  candidato  votos  pct_votos
0         A   3432    10.7972
1         B   8023    25.2407
2         C  12000    37.7525
3         D   8331    26.2097

SQL:

SELECT
	candidato,
	SUM(votos) as votos,
	ROUND(SUM(votos)/(SELECT SUM(votos) 
					   FROM resultados)::numeric*100,4) AS pct_votos
FROM resultados
GROUP BY 
	candidato
ORDER BY candidato

![](files/votos_sql.png)

Una de las curiosidades de las funciones anónimas es que nos permite alterar el funcionamiento natural de Pandas. Recordemos que Pandas en las funciones de agregación por default omite los valores NaN:

In [150]:
(df4.groupby(["foreig"])
        .agg({
            "price": "max",
            "rep78": "mean",
            "mpg":"std"
        })
)

          price     rep78       mpg
foreig
Domestic  15906  3.020833  4.743297
Foreign   12990  4.285714  6.611187

Recordemos en nuestro dataframe teníamos en rep78 varios valores NaN.

In [151]:
df4_nan

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
6,Buick Opel,4453,26,NaN,3.0,10,2230,170,34,304,2.87,Domestic
44,Plym. Sapporo,6486,26,NaN,1.5,8,2520,182,38,119,3.54,Domestic
50,Pont. Phoenix,4424,19,NaN,3.5,13,3420,203,43,231,3.08,Domestic
63,Peugeot 604,12990,14,NaN,3.5,14,3420,192,38,163,3.58,Foreign

Para evitar que Pandas omita los valores NaN vamos a usar skipna, parámetro que por default no funciona dentro de un groupby.

En su documentación podemos ver todos los parámetros válidos:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

In [152]:
df4.groupby(["foreig"])[["price","rep78","mpg"]].agg({
         #Notar que como explicitamos las columnas en un diccionario no usamos apply.
        'price': lambda x: x.max(skipna=False), 
        'rep78': lambda x: x.mean(skipna=False),
        'mpg': lambda x: x.std(skipna=False) 
         }
)

          price  rep78       mpg
foreig
Domestic  15906    NaN  4.743297
Foreign   12990    NaN  6.611187

### Estilos

Pandas permite personalizar nuestros dataframes para mejorar su output, nosotros apenas lo mencionaremos, quedan invitados a consultar la documentación respectiva en: 

* https://pandas.pydata.org/pandas-docs/version/1.1.5/user_guide/style.html

In [153]:
#Formato porcentaje
formato_pct_candidato = pct_candidato.copy()
formato_pct_candidato["pct_votos"]= formato_pct_candidato["pct_votos"]/100
formato_pct_candidato.style.format({"pct_votos": "{:.2%}"})

In [154]:
#Formato 2 decimales promedio y desvío con 2 decimales y ±
(df4.groupby(["foreig"])
     .agg(
        promedio_price=("price", "mean"),
        desvio_price=("price", "std")
     ).style.format({"promedio_price": "{:.2f}", "desvio_price": "± {:.2f}"}))

In [155]:
#Mapa de calor primeros 10 casos
df4.head(10).style.background_gradient(cmap="viridis")

In [156]:
#Grafico de barras en price, weight y length
df4.head(10).style.bar(subset=["price","weight","length"], color="#d65f5f")

### Strings
Pandas incluye varios métodos de strings para facilitar el data wrangling y realizar consultas.

In [157]:
#Todo a mayúscula
df4['make'].str.upper()

0       AMC CONCORD
1         AMC PACER
2        AMC SPIRIT
3     BUICK CENTURY
4     BUICK ELECTRA
          ...
69        VW DASHER
70        VW DIESEL
71        VW RABBIT
72      VW SCIROCCO
73        VOLVO 260
Name: make, Length: 74, dtype: object

In [158]:
#Todo a minúscula
df4['make'].str.lower()

0       amc concord
1         amc pacer
2        amc spirit
3     buick century
4     buick electra
          ...
69        vw dasher
70        vw diesel
71        vw rabbit
72      vw scirocco
73        volvo 260
Name: make, Length: 74, dtype: object

In [159]:
#Mayúscula primera palabra
df4['make'].str.capitalize()

0       Amc concord
1         Amc pacer
2        Amc spirit
3     Buick century
4     Buick electra
          ...
69        Vw dasher
70        Vw diesel
71        Vw rabbit
72      Vw scirocco
73        Volvo 260
Name: make, Length: 74, dtype: object

In [160]:
#Mayúscula cada palabra
df4['make'].str.title()

0       Amc Concord
1         Amc Pacer
2        Amc Spirit
3     Buick Century
4     Buick Electra
          ...
69        Vw Dasher
70        Vw Diesel
71        Vw Rabbit
72      Vw Scirocco
73        Volvo 260
Name: make, Length: 74, dtype: object

In [161]:
#Cambia mayúsculas por minúsculas y viceversa
df4['make'].str.swapcase()

0       amc cONCORD
1         amc pACER
2        amc sPIRIT
3     bUICK cENTURY
4     bUICK eLECTRA
          ...
69        vw dASHER
70        vw dIESEL
71        vw rABBIT
72      vw sCIROCCO
73        vOLVO 260
Name: make, Length: 74, dtype: object

In [162]:
#Substring primeros 3 caracteres
df4["make"].str[:3]

0     AMC
1     AMC
2     AMC
3     Bui
4     Bui
     ...
69    VW
70    VW
71    VW
72    VW
73    Vol
Name: make, Length: 74, dtype: object

In [163]:
#Substring últimos 5 caracteres
df4["make"].str[-5:]

0     ncord
1     Pacer
2     pirit
3     ntury
4     ectra
      ...
69    asher
70    iesel
71    abbit
72    rocco
73    o 260
Name: make, Length: 74, dtype: object

In [164]:
#Substring del 4to al 6to caracter
df4["make"].str[3:6]

0      Co
1      Pa
2      Sp
3     ck
4     ck
     ...
69    Das
70    Die
71    Rab
72    Sci
73    vo
Name: make, Length: 74, dtype: object

In [165]:
#Remover blancos extra (en este caso no hay)
#lstrip() remuevo blancos a la izquierda
#rstrip() remuevo blancos a la derecha

df4["make"].str.strip()

0       AMC Concord
1         AMC Pacer
2        AMC Spirit
3     Buick Century
4     Buick Electra
          ...
69        VW Dasher
70        VW Diesel
71        VW Rabbit
72      VW Scirocco
73        Volvo 260
Name: make, Length: 74, dtype: object

In [166]:
#Remover los blancos intermedios cuando no sobran
df4["make"].str.replace(" ","")

0       AMCConcord
1         AMCPacer
2        AMCSpirit
3     BuickCentury
4     BuickElectra
          ...
69        VWDasher
70        VWDiesel
71        VWRabbit
72      VWScirocco
73        Volvo260
Name: make, Length: 74, dtype: object

In [167]:
#Reemplazo AMC por ABC
df4["make"].str.replace("AMC","ABC")

0       ABC Concord
1         ABC Pacer
2        ABC Spirit
3     Buick Century
4     Buick Electra
          ...
69        VW Dasher
70        VW Diesel
71        VW Rabbit
72      VW Scirocco
73        Volvo 260
Name: make, Length: 74, dtype: object

* Zerofill:
Rellenar con ceros a la izquierda para que todos los registros tengan la misma longitud.

In [168]:
#Genero dataframe
zfill = pd.DataFrame([2,20,200,2000,20000], columns=["CODIGO_PRODUCTO"])
zfill

   CODIGO_PRODUCTO
0                2
1               20
2              200
3             2000
4            20000

In [169]:
#Convierto en string
zfill["CODIGO_PRODUCTO"]= zfill["CODIGO_PRODUCTO"].astype(str)
zfill.dtypes

CODIGO_PRODUCTO    object
dtype: object

In [170]:
#Relleno
zfill["CODIGO_PRODUCTO"]= zfill["CODIGO_PRODUCTO"].str.zfill(5)
zfill

  CODIGO_PRODUCTO
0           00002
1           00020
2           00200
3           02000
4           20000

* Pad:
Rellenar con caracteres hasta alcanzar cierta longitud. Puede entenderse como una versión más versátil de zerofill.

In [171]:
#Genero dataframe
padding= pd.DataFrame([2,20,200,2000,20000], columns=["CODIGO_PRODUCTO"])
padding["CODIGO_PRODUCTO"]= padding["CODIGO_PRODUCTO"].astype(str)
padding

  CODIGO_PRODUCTO
0               2
1              20
2             200
3            2000
4           20000

In [172]:
#side: permite elegir a la izquierda(left), derecha(right) y ambos lados(both)
padding["CODIGO_PRODUCTO"]= padding["CODIGO_PRODUCTO"].str.pad(width=10, side="both", fillchar="-")
padding

  CODIGO_PRODUCTO
0      ----2-----
1      ----20----
2      ---200----
3      ---2000---
4      --20000---

* Consultar nuestro dataframe en base a métodos de string

In [173]:
#Busco los registros que empiecen con AMC en make
df4[df4["make"].str.startswith("AMC")]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic

SQL:

SELECT *
FROM auto
WHERE make LIKE 'AMC%'

In [174]:
#Busco los registros que terminen con 10 en make
df4[df4["make"].str.endswith("10")]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
56,Datsun 210,4589,35,5.0,2.0,8,2020,165,32,85,3.70,Foreign
57,Datsun 510,5079,24,4.0,2.5,8,2280,170,34,119,3.54,Foreign
58,Datsun 810,8129,21,4.0,2.5,8,2750,184,38,146,3.55,Foreign

SQL:

SELECT *
FROM auto
WHERE make LIKE '%10'

In [175]:
#Busco los registros que contengan "yo" en make
df4[df4["make"].str.contains("yo")]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
66,Toyota Celica,5899,18,5.0,2.5,14,2410,174,36,134,3.06,Foreign
67,Toyota Corolla,3748,31,5.0,3.0,9,2200,165,35,97,3.21,Foreign
68,Toyota Corona,5719,18,5.0,2.0,11,2670,175,36,134,3.05,Foreign

SQL:

SELECT *
FROM auto
WHERE make LIKE '%yo%'

### JSON

JSON (JavaScript Object Notation) es un formato texto plano utilizado para almacenar datos, si bien surgió en JavaScript, al ser independiente de este lenguaje pudo lograr gran popularidad para el intercambio de datos.

Los archivos JSON dieron lugar a los formatos GeoJSON y TopoJSON que permiten almacenar datos espaciales. Una de las ventajas de estos últimos frente otros formatos de almacenamiento de datos espaciales, es que todos los datos se guardan en un único archivo, mientras que los tradicionales archivos shape se guardan en por lo menos en tres archivos distintos dependiendo  (.shp, .shx y .dbf) de los datos almacenados.

Probemos ahora guardar nuestro DataFrame de autos en JSON.

In [176]:
df4.to_json("data/auto.json")

Para leer un JSON y guardar un DataFrame como archivo JSON, Pandas ofrece varios parámetros, para profundizar en ellos consultar:

* https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_json.html

* https://pandas.pydata.org/docs/reference/api/pandas.io.json.read_json.html

Ahora abramos nuestro archivo auto.json

In [177]:
pd.read_json("data/auto.json")

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreig
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic
...,...,...,...,...,...,...,...,...,...,...,...,...
69,VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign
70,VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
71,VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
72,VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
73,Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign

In [178]:
import json
auto_json = open("data/auto.json")
auto_json = json.load(auto_json)

Como podemos ver, los archivos json se guardan por default con una estructura de diccionario anidado.

In [179]:
type(auto_json)

dict

In [180]:
auto_json

{'make': {'0': 'AMC Concord',
  '1': 'AMC Pacer',
  '2': 'AMC Spirit',
  '3': 'Buick Century',
  '4': 'Buick Electra',
  '5': 'Buick LeSabre',
  '6': 'Buick Opel',
  '7': 'Buick Regal',
  '8': 'Buick Riviera',
  '9': 'Buick Skylark',
  '10': 'Cad. Deville',
  '11': 'Cad. Eldorado',
  '12': 'Cad. Seville',
  '13': 'Chev. Chevette',
  '14': 'Chev. Impala',
  '15': 'Chev. Malibu',
  '16': 'Chev. Monte Carlo',
  '17': 'Chev. Monza',
  '18': 'Chev. Nova',
  '19': 'Dodge Colt',
  '20': 'Dodge Diplomat',
  '21': 'Dodge Magnum',
  '22': 'Dodge St. Regis',
  '23': 'Ford Fiesta',
  '24': 'Ford Mustang',
  '25': 'Linc. Continental',
  '26': 'Linc. Mark V',
  '27': 'Linc. Versailles',
  '28': 'Merc. Bobcat',
  '29': 'Merc. Cougar',
  '30': 'Merc. Marquis',
  '31': 'Merc. Monarch',
  '32': 'Merc. XR-7',
  '33': 'Merc. Zephyr',
  '34': 'Olds 98',
  '35': 'Olds Cutl Supr',
  '36': 'Olds Cutlass',
  '37': 'Olds Delta 88',
  '38': 'Olds Omega',
  '39': 'Olds Starfire',
  '40': 'Olds Toronado',
  '41': 'Plym. Arrow',
  '42': 'Plym. Champ',
  '43': 'Plym. Horizon',
  '44': 'Plym. Sapporo',
  '45': 'Plym. Volare',
  '46': 'Pont. Catalina',
  '47': 'Pont. Firebird',
  '48': 'Pont. Grand Prix',
  '49': 'Pont. Le Mans',
  '50': 'Pont. Phoenix',
  '51': 'Pont. Sunbird',
  '52': 'Audi 5000',
  '53': 'Audi Fox',
  '54': 'BMW 320i',
  '55': 'Datsun 200',
  '56': 'Datsun 210',
  '57': 'Datsun 510',
  '58': 'Datsun 810',
  '59': 'Fiat Strada',
  '60': 'Honda Accord',
  '61': 'Honda Civic',
  '62': 'Mazda GLC',
  '63': 'Peugeot 604',
  '64': 'Renault Le Car',
  '65': 'Subaru',
  '66': 'Toyota Celica',
  '67': 'Toyota Corolla',
  '68': 'Toyota Corona',
  '69': 'VW Dasher',
  '70': 'VW Diesel',
  '71': 'VW Rabbit',
  '72': 'VW Scirocco',
  '73': 'Volvo 260'},
 'price': {'0': 4099,
  '1': 4749,
  '2': 3799,
  '3': 4816,
  '4': 7827,
  '5': 5788,
  '6': 4453,
  '7': 5189,
  '8': 10372,
  '9': 4082,
  '10': 11385,
  '11': 14500,
  '12': 15906,
  '13': 3299,
  '14': 5705,
  '15': 4504,
  '16': 5104,
  '17': 3667,
  '18': 3955,
  '19': 3984,
  '20': 4010,
  '21': 5886,
  '22': 6342,
  '23': 4389,
  '24': 4187,
  '25': 11497,
  '26': 13594,
  '27': 13466,
  '28': 3829,
  '29': 5379,
  '30': 6165,
  '31': 4516,
  '32': 6303,
  '33': 3291,
  '34': 8814,
  '35': 5172,
  '36': 4733,
  '37': 4890,
  '38': 4181,
  '39': 4195,
  '40': 10371,
  '41': 4647,
  '42': 4425,
  '43': 4482,
  '44': 6486,
  '45': 4060,
  '46': 5798,
  '47': 4934,
  '48': 5222,
  '49': 4723,
  '50': 4424,
  '51': 4172,
  '52': 9690,
  '53': 6295,
  '54': 9735,
  '55': 6229,
  '56': 4589,
  '57': 5079,
  '58': 8129,
  '59': 4296,
  '60': 5799,
  '61': 4499,
  '62': 3995,
  '63': 12990,
  '64': 3895,
  '65': 3798,
  '66': 5899,
  '67': 3748,
  '68': 5719,
  '69': 7140,
  '70': 5397,
  '71': 4697,
  '72': 6850,
  '73': 11995},
 'mpg': {'0': 22,
  '1': 17,
  '2': 22,
  '3': 20,
  '4': 15,
  '5': 18,
  '6': 26,
  '7': 20,
  '8': 16,
  '9': 19,
  '10': 14,
  '11': 14,
  '12': 21,
  '13': 29,
  '14': 16,
  '15': 22,
  '16': 22,
  '17': 24,
  '18': 19,
  '19': 30,
  '20': 18,
  '21': 16,
  '22': 17,
  '23': 28,
  '24': 21,
  '25': 12,
  '26': 12,
  '27': 14,
  '28': 22,
  '29': 14,
  '30': 15,
  '31': 18,
  '32': 14,
  '33': 20,
  '34': 21,
  '35': 19,
  '36': 19,
  '37': 18,
  '38': 19,
  '39': 24,
  '40': 16,
  '41': 28,
  '42': 34,
  '43': 25,
  '44': 26,
  '45': 18,
  '46': 18,
  '47': 18,
  '48': 19,
  '49': 19,
  '50': 19,
  '51': 24,
  '52': 17,
  '53': 23,
  '54': 25,
  '55': 23,
  '56': 35,
  '57': 24,
  '58': 21,
  '59': 21,
  '60': 25,
  '61': 28,
  '62': 30,
  '63': 14,
  '64': 26,
  '65': 35,
  '66': 18,
  '67': 31,
  '68': 18,
  '69': 23,
  '70': 41,
  '71': 25,
  '72': 25,
  '73': 17},
 'rep78': {'0': 3.0,
  '1': 3.0,
  '2': None,
  '3': 3.0,
  '4': 4.0,
  '5': 3.0,
  '6': None,
  '7': 3.0,
  '8': 3.0,
  '9': 3.0,
  '10': 3.0,
  '11': 2.0,
  '12': 3.0,
  '13': 3.0,
  '14': 4.0,
  '15': 3.0,
  '16': 2.0,
  '17': 2.0,
  '18': 3.0,
  '19': 5.0,
  '20': 2.0,
  '21': 2.0,
  '22': 2.0,
  '23': 4.0,
  '24': 3.0,
  '25': 3.0,
  '26': 3.0,
  '27': 3.0,
  '28': 4.0,
  '29': 4.0,
  '30': 3.0,
  '31': 3.0,
  '32': 4.0,
  '33': 3.0,
  '34': 4.0,
  '35': 3.0,
  '36': 3.0,
  '37': 4.0,
  '38': 3.0,
  '39': 1.0,
  '40': 3.0,
  '41': 3.0,
  '42': 5.0,
  '43': 3.0,
  '44': None,
  '45': 2.0,
  '46': 4.0,
  '47': 1.0,
  '48': 3.0,
  '49': 3.0,
  '50': None,
  '51': 2.0,
  '52': 5.0,
  '53': 3.0,
  '54': 4.0,
  '55': 4.0,
  '56': 5.0,
  '57': 4.0,
  '58': 4.0,
  '59': 3.0,
  '60': 5.0,
  '61': 4.0,
  '62': 4.0,
  '63': None,
  '64': 3.0,
  '65': 5.0,
  '66': 5.0,
  '67': 5.0,
  '68': 5.0,
  '69': 4.0,
  '70': 5.0,
  '71': 4.0,
  '72': 4.0,
  '73': 5.0},
 'headroom': {'0': 2.5,
  '1': 3.0,
  '2': 3.0,
  '3': 4.5,
  '4': 4.0,
  '5': 4.0,
  '6': 3.0,
  '7': 2.0,
  '8': 3.5,
  '9': 3.5,
  '10': 4.0,
  '11': 3.5,
  '12': 3.0,
  '13': 2.5,
  '14': 4.0,
  '15': 3.5,
  '16': 2.0,
  '17': 2.0,
  '18': 3.5,
  '19': 2.0,
  '20': 4.0,
  '21': 4.0,
  '22': 4.5,
  '23': 1.5,
  '24': 2.0,
  '25': 3.5,
  '26': 2.5,
  '27': 3.5,
  '28': 3.0,
  '29': 3.5,
  '30': 3.5,
  '31': 3.0,
  '32': 3.0,
  '33': 3.5,
  '34': 4.0,
  '35': 2.0,
  '36': 4.5,
  '37': 4.0,
  '38': 4.5,
  '39': 2.0,
  '40': 3.5,
  '41': 2.0,
  '42': 2.5,
  '43': 4.0,
  '44': 1.5,
  '45': 5.0,
  '46': 4.0,
  '47': 1.5,
  '48': 2.0,
  '49': 3.5,
  '50': 3.5,
  '51': 2.0,
  '52': 3.0,
  '53': 2.5,
  '54': 2.5,
  '55': 1.5,
  '56': 2.0,
  '57': 2.5,
  '58': 2.5,
  '59': 2.5,
  '60': 3.0,
  '61': 2.5,
  '62': 3.5,
  '63': 3.5,
  '64': 3.0,
  '65': 2.5,
  '66': 2.5,
  '67': 3.0,
  '68': 2.0,
  '69': 2.5,
  '70': 3.0,
  '71': 3.0,
  '72': 2.0,
  '73': 2.5},
 'trunk': {'0': 11,
  '1': 11,
  '2': 12,
  '3': 16,
  '4': 20,
  '5': 21,
  '6': 10,
  '7': 16,
  '8': 17,
  '9': 13,
  '10': 20,
  '11': 16,
  '12': 13,
  '13': 9,
  '14': 20,
  '15': 17,
  '16': 16,
  '17': 7,
  '18': 13,
  '19': 8,
  '20': 17,
  '21': 17,
  '22': 21,
  '23': 9,
  '24': 10,
  '25': 22,
  '26': 18,
  '27': 15,
  '28': 9,
  '29': 16,
  '30': 23,
  '31': 15,
  '32': 16,
  '33': 17,
  '34': 20,
  '35': 16,
  '36': 16,
  '37': 20,
  '38': 14,
  '39': 10,
  '40': 17,
  '41': 11,
  '42': 11,
  '43': 17,
  '44': 8,
  '45': 16,
  '46': 20,
  '47': 7,
  '48': 16,
  '49': 17,
  '50': 13,
  '51': 7,
  '52': 15,
  '53': 11,
  '54': 12,
  '55': 6,
  '56': 8,
  '57': 8,
  '58': 8,
  '59': 16,
  '60': 10,
  '61': 5,
  '62': 11,
  '63': 14,
  '64': 10,
  '65': 11,
  '66': 14,
  '67': 9,
  '68': 11,
  '69': 12,
  '70': 15,
  '71': 15,
  '72': 16,
  '73': 14},
 'weight': {'0': 2930,
  '1': 3350,
  '2': 2640,
  '3': 3250,
  '4': 4080,
  '5': 3670,
  '6': 2230,
  '7': 3280,
  '8': 3880,
  '9': 3400,
  '10': 4330,
  '11': 3900,
  '12': 4290,
  '13': 2110,
  '14': 3690,
  '15': 3180,
  '16': 3220,
  '17': 2750,
  '18': 3430,
  '19': 2120,
  '20': 3600,
  '21': 3600,
  '22': 3740,
  '23': 1800,
  '24': 2650,
  '25': 4840,
  '26': 4720,
  '27': 3830,
  '28': 2580,
  '29': 4060,
  '30': 3720,
  '31': 3370,
  '32': 4130,
  '33': 2830,
  '34': 4060,
  '35': 3310,
  '36': 3300,
  '37': 3690,
  '38': 3370,
  '39': 2730,
  '40': 4030,
  '41': 3260,
  '42': 1800,
  '43': 2200,
  '44': 2520,
  '45': 3330,
  '46': 3700,
  '47': 3470,
  '48': 3210,
  '49': 3200,
  '50': 3420,
  '51': 2690,
  '52': 2830,
  '53': 2070,
  '54': 2650,
  '55': 2370,
  '56': 2020,
  '57': 2280,
  '58': 2750,
  '59': 2130,
  '60': 2240,
  '61': 1760,
  '62': 1980,
  '63': 3420,
  '64': 1830,
  '65': 2050,
  '66': 2410,
  '67': 2200,
  '68': 2670,
  '69': 2160,
  '70': 2040,
  '71': 1930,
  '72': 1990,
  '73': 3170},
 'length': {'0': 186,
  '1': 173,
  '2': 168,
  '3': 196,
  '4': 222,
  '5': 218,
  '6': 170,
  '7': 200,
  '8': 207,
  '9': 200,
  '10': 221,
  '11': 204,
  '12': 204,
  '13': 163,
  '14': 212,
  '15': 193,
  '16': 200,
  '17': 179,
  '18': 197,
  '19': 163,
  '20': 206,
  '21': 206,
  '22': 220,
  '23': 147,
  '24': 179,
  '25': 233,
  '26': 230,
  '27': 201,
  '28': 169,
  '29': 221,
  '30': 212,
  '31': 198,
  '32': 217,
  '33': 195,
  '34': 220,
  '35': 198,
  '36': 198,
  '37': 218,
  '38': 200,
  '39': 180,
  '40': 206,
  '41': 170,
  '42': 157,
  '43': 165,
  '44': 182,
  '45': 201,
  '46': 214,
  '47': 198,
  '48': 201,
  '49': 199,
  '50': 203,
  '51': 179,
  '52': 189,
  '53': 174,
  '54': 177,
  '55': 170,
  '56': 165,
  '57': 170,
  '58': 184,
  '59': 161,
  '60': 172,
  '61': 149,
  '62': 154,
  '63': 192,
  '64': 142,
  '65': 164,
  '66': 174,
  '67': 165,
  '68': 175,
  '69': 172,
  '70': 155,
  '71': 155,
  '72': 156,
  '73': 193},
 'turn': {'0': 40,
  '1': 40,
  '2': 35,
  '3': 40,
  '4': 43,
  '5': 43,
  '6': 34,
  '7': 42,
  '8': 43,
  '9': 42,
  '10': 44,
  '11': 43,
  '12': 45,
  '13': 34,
  '14': 43,
  '15': 31,
  '16': 41,
  '17': 40,
  '18': 43,
  '19': 35,
  '20': 46,
  '21': 46,
  '22': 46,
  '23': 33,
  '24': 43,
  '25': 51,
  '26': 48,
  '27': 41,
  '28': 39,
  '29': 48,
  '30': 44,
  '31': 41,
  '32': 45,
  '33': 43,
  '34': 43,
  '35': 42,
  '36': 42,
  '37': 42,
  '38': 43,
  '39': 40,
  '40': 43,
  '41': 37,
  '42': 37,
  '43': 36,
  '44': 38,
  '45': 44,
  '46': 42,
  '47': 42,
  '48': 45,
  '49': 40,
  '50': 43,
  '51': 41,
  '52': 37,
  '53': 36,
  '54': 34,
  '55': 35,
  '56': 32,
  '57': 34,
  '58': 38,
  '59': 36,
  '60': 36,
  '61': 34,
  '62': 33,
  '63': 38,
  '64': 34,
  '65': 36,
  '66': 36,
  '67': 35,
  '68': 36,
  '69': 36,
  '70': 35,
  '71': 35,
  '72': 36,
  '73': 37},
 'displacement': {'0': 121,
  '1': 258,
  '2': 121,
  '3': 196,
  '4': 350,
  '5': 231,
  '6': 304,
  '7': 196,
  '8': 231,
  '9': 231,
  '10': 425,
  '11': 350,
  '12': 350,
  '13': 231,
  '14': 250,
  '15': 200,
  '16': 200,
  '17': 151,
  '18': 250,
  '19': 98,
  '20': 318,
  '21': 318,
  '22': 225,
  '23': 98,
  '24': 140,
  '25': 400,
  '26': 400,
  '27': 302,
  '28': 140,
  '29': 302,
  '30': 302,
  '31': 250,
  '32': 302,
  '33': 140,
  '34': 350,
  '35': 231,
  '36': 231,
  '37': 231,
  '38': 231,
  '39': 151,
  '40': 350,
  '41': 156,
  '42': 86,
  '43': 105,
  '44': 119,
  '45': 225,
  '46': 231,
  '47': 231,
  '48': 231,
  '49': 231,
  '50': 231,
  '51': 151,
  '52': 131,
  '53': 97,
  '54': 121,
  '55': 119,
  '56': 85,
  '57': 119,
  '58': 146,
  '59': 105,
  '60': 107,
  '61': 91,
  '62': 86,
  '63': 163,
  '64': 79,
  '65': 97,
  '66': 134,
  '67': 97,
  '68': 134,
  '69': 97,
  '70': 90,
  '71': 89,
  '72': 97,
  '73': 163},
 'gear_ratio': {'0': 3.5799999,
  '1': 2.53,
  '2': 3.0799999,
  '3': 2.9300001,
  '4': 2.4100001,
  '5': 2.73,
  '6': 2.8699999,
  '7': 2.9300001,
  '8': 2.9300001,
  '9': 3.0799999,
  '10': 2.28,
  '11': 2.1900001,
  '12': 2.24,
  '13': 2.9300001,
  '14': 2.5599999,
  '15': 2.73,
  '16': 2.73,
  '17': 2.73,
  '18': 2.5599999,
  '19': 3.54,
  '20': 2.47,
  '21': 2.47,
  '22': 2.9400001,
  '23': 3.1500001,
  '24': 3.0799999,
  '25': 2.47,
  '26': 2.47,
  '27': 2.47,
  '28': 2.73,
  '29': 2.75,
  '30': 2.26,
  '31': 2.4300001,
  '32': 2.75,
  '33': 3.0799999,
  '34': 2.4100001,
  '35': 2.9300001,
  '36': 2.9300001,
  '37': 2.73,
  '38': 3.0799999,
  '39': 2.73,
  '40': 2.4100001,
  '41': 3.05,
  '42': 2.97,
  '43': 3.3699999,
  '44': 3.54,
  '45': 3.23,
  '46': 2.73,
  '47': 3.0799999,
  '48': 2.9300001,
  '49': 2.9300001,
  '50': 3.0799999,
  '51': 2.73,
  '52': 3.2,
  '53': 3.7,
  '54': 3.6400001,
  '55': 3.8900001,
  '56': 3.7,
  '57': 3.54,
  '58': 3.55,
  '59': 3.3699999,
  '60': 3.05,
  '61': 3.3,
  '62': 3.73,
  '63': 3.5799999,
  '64': 3.72,
  '65': 3.8099999,
  '66': 3.0599999,
  '67': 3.21,
  '68': 3.05,
  '69': 3.74,
  '70': 3.78,
  '71': 3.78,
  '72': 3.78,
  '73': 2.98},
 'foreig': {'0': 'Domestic',
  '1': 'Domestic',
  '2': 'Domestic',
  '3': 'Domestic',
  '4': 'Domestic',
  '5': 'Domestic',
  '6': 'Domestic',
  '7': 'Domestic',
  '8': 'Domestic',
  '9': 'Domestic',
  '10': 'Domestic',
  '11': 'Domestic',
  '12': 'Domestic',
  '13': 'Domestic',
  '14': 'Domestic',
  '15': 'Domestic',
  '16': 'Domestic',
  '17': 'Domestic',
  '18': 'Domestic',
  '19': 'Domestic',
  '20': 'Domestic',
  '21': 'Domestic',
  '22': 'Domestic',
  '23': 'Domestic',
  '24': 'Domestic',
  '25': 'Domestic',
  '26': 'Domestic',
  '27': 'Domestic',
  '28': 'Domestic',
  '29': 'Domestic',
  '30': 'Domestic',
  '31': 'Domestic',
  '32': 'Domestic',
  '33': 'Domestic',
  '34': 'Domestic',
  '35': 'Domestic',
  '36': 'Domestic',
  '37': 'Domestic',
  '38': 'Domestic',
  '39': 'Domestic',
  '40': 'Domestic',
  '41': 'Domestic',
  '42': 'Domestic',
  '43': 'Domestic',
  '44': 'Domestic',
  '45': 'Domestic',
  '46': 'Domestic',
  '47': 'Domestic',
  '48': 'Domestic',
  '49': 'Domestic',
  '50': 'Domestic',
  '51': 'Domestic',
  '52': 'Foreign',
  '53': 'Foreign',
  '54': 'Foreign',
  '55': 'Foreign',
  '56': 'Foreign',
  '57': 'Foreign',
  '58': 'Foreign',
  '59': 'Foreign',
  '60': 'Foreign',
  '61': 'Foreign',
  '62': 'Foreign',
  '63': 'Foreign',
  '64': 'Foreign',
  '65': 'Foreign',
  '66': 'Foreign',
  '67': 'Foreign',
  '68': 'Foreign',
  '69': 'Foreign',
  '70': 'Foreign',
  '71': 'Foreign',
  '72': 'Foreign',
  '73': 'Foreign'}}

No es la intención de este apartado profundizar en los archivos JSON, pero sí debemos familiarizarnos con ellos, ya que a partir de sus variantes que soportan datos geográficos, aprenderemos un poco de análisis espacial.

### Bibliografía

https://pandas.pydata.org/docs/index.html